/*
SQLyog v10.2 
MySQL - 5.5.20 : Database - com_yyg
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`com_yyg` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `com_yyg`;

/*Table structure for table `b_business` */

DROP TABLE IF EXISTS `b_business`;

CREATE TABLE `b_business` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商家id',
  `name` varchar(50) NOT NULL COMMENT '商家名称',
  `area_p` varchar(6) NOT NULL COMMENT '省',
  `area_c` varchar(6) DEFAULT NULL COMMENT '市',
  `area_d` varchar(6) DEFAULT NULL COMMENT '县',
  `address` varchar(50) NOT NULL COMMENT '地址',
  `status` int(2) NOT NULL DEFAULT '1' COMMENT '状态',
  `mobile` varchar(11) NOT NULL COMMENT '手机号',
  `telephone` varchar(20) DEFAULT NULL COMMENT '电话号码',
  `btype` int(2) NOT NULL DEFAULT '0' COMMENT '0普通商家',
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '新增时间',
  `updatetime` timestamp NULL DEFAULT NULL COMMENT '修改时间',
  `confirmtime` timestamp NULL DEFAULT NULL COMMENT '审核时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`),
  KEY `status` (`status`,`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `b_business` */

/*Table structure for table `duals` */

DROP TABLE IF EXISTS `duals`;

CREATE TABLE `duals` (
  `id` int(1) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `duals` */

insert  into `duals`(`id`) values (1);

/*Table structure for table `job_log` */

DROP TABLE IF EXISTS `job_log`;

CREATE TABLE `job_log` (
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `name` varchar(30) NOT NULL COMMENT '名称',
  `memo` varchar(1000) DEFAULT NULL COMMENT '描述',
  KEY `createtime` (`createtime`,`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `job_log` */

/*Table structure for table `o_order` */

DROP TABLE IF EXISTS `o_order`;

CREATE TABLE `o_order` (
  `id` int(30) NOT NULL AUTO_INCREMENT COMMENT '订单id',
  `orderno` varchar(30) NOT NULL COMMENT 'php生成订单编号',
  `pid` int(11) NOT NULL COMMENT '产品id',
  `tid` int(11) NOT NULL COMMENT '产品类型id',
  `sid` int(20) NOT NULL COMMENT '策略id',
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `ordernum` int(6) NOT NULL COMMENT '订单所属策略期数',
  `status` int(2) NOT NULL DEFAULT '0' COMMENT '状态',
  `max_count` int(11) NOT NULL COMMENT 'p_strategy',
  `min_count` int(11) NOT NULL COMMENT 'p_strategy',
  `begin_price` decimal(18,2) NOT NULL COMMENT 'p_strategy',
  `prod_price` decimal(18,2) NOT NULL COMMENT 'p_strategy',
  `personNums` int(8) NOT NULL COMMENT 'p_strategy',
  `max_process` float NOT NULL COMMENT 'p_strategy',
  `now_price` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '目前金额',
  `endtime` timestamp NULL DEFAULT NULL COMMENT '完成时间',
  `endno` int(6) DEFAULT NULL COMMENT '中奖号码',
  `frozen_price` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '冻结金额',
  PRIMARY KEY (`id`),
  UNIQUE KEY `orderno` (`orderno`),
  KEY `sid` (`sid`,`ordernum`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

/*Data for the table `o_order` */

insert  into `o_order`(`id`,`orderno`,`pid`,`tid`,`sid`,`createtime`,`ordernum`,`status`,`max_count`,`min_count`,`begin_price`,`prod_price`,`personNums`,`max_process`,`now_price`,`endtime`,`endno`,`frozen_price`) values (8,'2016021618112758448581',4,14,4,'2016-02-16 18:11:27',2,11,0,1,'1.00','1.00',0,0,'1.00','2016-02-17 09:44:46',100001,'0.00'),(9,'2016021709444686917117',4,14,4,'2016-02-17 09:44:46',3,11,0,1,'1.00','1.00',0,0,'1.00','2016-02-17 10:50:15',100001,'0.00'),(10,'2016021710501579147067',4,14,4,'2016-02-17 10:50:15',4,0,0,1,'1.00','1.00',0,0,'0.00',NULL,NULL,'0.00');

/*Table structure for table `o_ordercode` */

DROP TABLE IF EXISTS `o_ordercode`;

CREATE TABLE `o_ordercode` (
  `orderno` varchar(30) NOT NULL COMMENT '订单号',
  `uid` int(11) NOT NULL COMMENT '参与人',
  `utime` varchar(24) NOT NULL COMMENT 'yyyy-mm-dd hh:mm:ss:fff',
  `ucode` int(8) NOT NULL COMMENT '中奖号码',
  PRIMARY KEY (`orderno`,`ucode`),
  KEY `orderno` (`orderno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `o_ordercode` */

insert  into `o_ordercode`(`orderno`,`uid`,`utime`,`ucode`) values ('2016021618112758448581',1,'2016-02-17 09:52:14.951',100001),('2016021709444686917117',1,'2016-02-17 10:57:42.914',100001);

/*Table structure for table `o_orderuser` */

DROP TABLE IF EXISTS `o_orderuser`;

CREATE TABLE `o_orderuser` (
  `orderno` varchar(30) NOT NULL COMMENT '策略订单号',
  `uid` int(11) NOT NULL COMMENT '参与人',
  `utime` varchar(23) NOT NULL COMMENT 'yyyy-mm-dd hh:mm:ss:fff',
  `times` int(8) NOT NULL COMMENT '参与次数',
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '创建时间',
  `ou_orderno` varchar(30) NOT NULL COMMENT '用户订单号-ou_order',
  PRIMARY KEY (`orderno`,`uid`,`utime`),
  KEY `ou_orderno` (`ou_orderno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='该表数据由ou_order,ou_orderinfo\r\n付款后转移过来';

/*Data for the table `o_orderuser` */

insert  into `o_orderuser`(`orderno`,`uid`,`utime`,`times`,`createtime`,`ou_orderno`) values ('2016021618112758448581',1,'2016-02-17 09:52:14.951',1,'2016-02-17 09:44:46','2016021709515910299561'),('2016021709444686917117',1,'2016-02-17 10:57:42.914',1,'2016-02-17 10:50:15','2016021710565353984910');

/*Table structure for table `oo_order` */

DROP TABLE IF EXISTS `oo_order`;

CREATE TABLE `oo_order` (
  `id` int(30) NOT NULL AUTO_INCREMENT COMMENT '订单id',
  `orderno` varchar(30) NOT NULL COMMENT 'php生成订单编号',
  `pid` int(11) NOT NULL COMMENT '产品id',
  `tid` int(11) NOT NULL COMMENT '产品类型id',
  `sid` int(20) NOT NULL COMMENT '策略id',
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `ordernum` int(6) NOT NULL COMMENT '订单所属策略期数',
  `status` int(2) NOT NULL DEFAULT '0' COMMENT '状态',
  `max_count` int(11) NOT NULL COMMENT 'p_strategy',
  `min_count` int(11) NOT NULL COMMENT 'p_strategy',
  `begin_price` decimal(18,2) NOT NULL COMMENT 'p_strategy',
  `prod_price` decimal(18,2) NOT NULL COMMENT 'p_strategy',
  `personNums` int(8) NOT NULL COMMENT 'p_strategy',
  `max_process` float NOT NULL COMMENT 'p_strategy',
  `now_price` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '目前金额',
  `endtime` timestamp NULL DEFAULT NULL COMMENT '完成时间',
  `endno` int(6) DEFAULT NULL COMMENT '中奖号码',
  `frozen_price` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '冻结金额',
  PRIMARY KEY (`id`),
  UNIQUE KEY `orderno` (`orderno`),
  KEY `sid` (`sid`,`ordernum`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

/*Data for the table `oo_order` */

insert  into `oo_order`(`id`,`orderno`,`pid`,`tid`,`sid`,`createtime`,`ordernum`,`status`,`max_count`,`min_count`,`begin_price`,`prod_price`,`personNums`,`max_process`,`now_price`,`endtime`,`endno`,`frozen_price`) values (8,'2016021618112758448581',4,14,4,'2016-02-16 18:11:27',2,11,0,1,'1.00','1.00',0,0,'1.00','2016-02-17 09:44:46',100001,'0.00'),(9,'2016021709444686917117',4,14,4,'2016-02-17 09:44:46',3,11,0,1,'1.00','1.00',0,0,'1.00','2016-02-17 10:50:15',100001,'0.00');

/*Table structure for table `oo_ordercode` */

DROP TABLE IF EXISTS `oo_ordercode`;

CREATE TABLE `oo_ordercode` (
  `orderno` varchar(30) NOT NULL COMMENT '订单号',
  `uid` int(11) NOT NULL COMMENT '参与人',
  `utime` varchar(24) NOT NULL COMMENT 'yyyy-mm-dd hh:mm:ss:fff',
  `ucode` int(8) NOT NULL COMMENT '中奖号码',
  PRIMARY KEY (`orderno`,`ucode`),
  KEY `orderno` (`orderno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `oo_ordercode` */

insert  into `oo_ordercode`(`orderno`,`uid`,`utime`,`ucode`) values ('2016021618112758448581',1,'2016-02-17 09:52:14.951',100001),('2016021709444686917117',1,'2016-02-17 10:57:42.914',100001);

/*Table structure for table `oo_orderuser` */

DROP TABLE IF EXISTS `oo_orderuser`;

CREATE TABLE `oo_orderuser` (
  `orderno` varchar(30) NOT NULL COMMENT '策略订单号',
  `uid` int(11) NOT NULL COMMENT '参与人',
  `utime` varchar(23) NOT NULL COMMENT 'yyyy-mm-dd hh:mm:ss:fff',
  `times` int(8) NOT NULL COMMENT '参与次数',
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '创建时间',
  `ou_orderno` varchar(30) NOT NULL COMMENT '用户订单号-ou_order',
  PRIMARY KEY (`orderno`,`uid`,`utime`),
  KEY `ou_orderno` (`ou_orderno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='该表数据由ou_order,ou_orderinfo\r\n付款后转移过来';

/*Data for the table `oo_orderuser` */

insert  into `oo_orderuser`(`orderno`,`uid`,`utime`,`times`,`createtime`,`ou_orderno`) values ('2016021618112758448581',1,'2016-02-17 09:52:14.951',1,'2016-02-17 09:44:46','2016021709515910299561'),('2016021709444686917117',1,'2016-02-17 10:57:42.914',1,'2016-02-17 10:50:15','2016021710565353984910');

/*Table structure for table `ou_order` */

DROP TABLE IF EXISTS `ou_order`;

CREATE TABLE `ou_order` (
  `orderno` varchar(30) NOT NULL COMMENT '用户订单号',
  `uid` int(11) NOT NULL COMMENT '用户id',
  `status` int(2) NOT NULL DEFAULT '12' COMMENT '状态，0已经付款，12未付款',
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `utime` varchar(23) DEFAULT NULL COMMENT 'yyyy-mm-dd hh:mm:ss:fff',
  `closetime` timestamp NULL DEFAULT NULL COMMENT '自动关闭时间',
  `ispay` int(1) NOT NULL DEFAULT '0' COMMENT '是否已经支付，1已经支付',
  PRIMARY KEY (`orderno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `ou_order` */

insert  into `ou_order`(`orderno`,`uid`,`status`,`createtime`,`utime`,`closetime`,`ispay`) values ('2016021709515910299561',1,0,'2016-02-17 09:44:32','2016-02-17 09:52:14.951',NULL,0),('2016021710565353984910',1,0,'2016-02-17 10:49:26','2016-02-17 10:57:42.914',NULL,0);

/*Table structure for table `ou_orderinfo` */

DROP TABLE IF EXISTS `ou_orderinfo`;

CREATE TABLE `ou_orderinfo` (
  `orderno` varchar(30) NOT NULL COMMENT '策略订单号',
  `ou_orderno` varchar(30) NOT NULL COMMENT '用户订单号-ou_order',
  `times` int(8) NOT NULL COMMENT '参与次数',
  PRIMARY KEY (`orderno`,`ou_orderno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `ou_orderinfo` */

insert  into `ou_orderinfo`(`orderno`,`ou_orderno`,`times`) values ('2016021618112758448581','2016021709515910299561',1),('2016021709444686917117','2016021710565353984910',1);

/*Table structure for table `p_photos` */

DROP TABLE IF EXISTS `p_photos`;

CREATE TABLE `p_photos` (
  `pid` int(11) NOT NULL COMMENT '产品id',
  `imgurl` varchar(200) NOT NULL COMMENT '图片路径',
  `ptype` int(1) NOT NULL DEFAULT '1' COMMENT '类型，0普通，1产品主图，2首页推荐块，3首页列表块',
  KEY `pid` (`pid`,`ptype`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `p_photos` */

insert  into `p_photos`(`pid`,`imgurl`,`ptype`) values (2,'/assets/img/pro/pro11-01.jpg',1),(4,'/assets/img/pro/pro11-01.jpg',1),(1,'/assets/img/pro/pro11-01.jpg',1);

/*Table structure for table `p_prodhot` */

DROP TABLE IF EXISTS `p_prodhot`;

CREATE TABLE `p_prodhot` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '推荐产品id',
  `name` varchar(100) NOT NULL COMMENT '产品名称',
  `ptype` int(1) NOT NULL COMMENT '类型，1焦点图，2首页块左边，3首页块右边，4首页为你推荐必须是产品',
  `status` int(2) NOT NULL DEFAULT '0' COMMENT '状态',
  `begindate` date NOT NULL COMMENT '开始日期',
  `enddate` date NOT NULL COMMENT '结束日期',
  `url` varchar(200) NOT NULL COMMENT '链接路径',
  `pid` int(11) DEFAULT NULL COMMENT '对应产品id',
  `imgurl` varchar(200) DEFAULT NULL COMMENT '图片url',
  PRIMARY KEY (`id`),
  KEY `status` (`status`,`begindate`,`enddate`,`ptype`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

/*Data for the table `p_prodhot` */

insert  into `p_prodhot`(`id`,`name`,`ptype`,`status`,`begindate`,`enddate`,`url`,`pid`,`imgurl`) values (1,'焦点图',1,0,'2015-12-09','2016-12-12','javascript:;',NULL,'/assets/img/banner/idx02-52.png'),(2,'焦点图',1,0,'2015-12-22','2016-12-12','javascript:;',NULL,'/assets/img/banner/idx02-52.png'),(3,'焦点图',1,99,'2015-12-09','2016-12-12','javascript:;',NULL,'/assets/img/banner/idx02-52.png'),(4,'焦点图',1,0,'2015-12-08','2016-12-12','javascript:;',NULL,'/assets/img/banner/idx02-52.png'),(5,'焦点图',1,0,'2015-12-07','2016-12-12','javascript:;',NULL,'/assets/img/banner/idx02-52.png'),(6,'Iphone6 手机',2,0,'2015-12-08','2016-12-12','javascript:;',4,'/assets/img/pro/pro11-01.jpg'),(7,'Iphone5',3,0,'2015-12-09','2016-12-12','javascript:;',4,'/assets/img/pro/pro21-01.jpg'),(8,'Iphone5',3,0,'2015-12-08','2016-12-12','javascript:;',4,'/assets/img/pro/pro21-01.jpg'),(9,'[重磅推荐] IPhone6S 16/64G 金色/粉色/白色 只要1元，便有机会领回家，既能么么哒，又能啪啪啪',4,0,'2015-12-06','2016-12-12','javascript:;',4,'/assets/img/pro/pro11-01.jpg');

/*Table structure for table `p_prods` */

DROP TABLE IF EXISTS `p_prods`;

CREATE TABLE `p_prods` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '产品id',
  `name` varchar(50) NOT NULL COMMENT '产品名称',
  `info` varchar(200) NOT NULL COMMENT '产品描述',
  `status` int(2) NOT NULL DEFAULT '1' COMMENT '状态',
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '新增时间',
  `updatetime` timestamp NULL DEFAULT NULL COMMENT '修改时间',
  `confirmtime` timestamp NULL DEFAULT NULL COMMENT '审核时间',
  `tid` int(2) NOT NULL COMMENT '产品类别',
  `price` decimal(18,2) NOT NULL COMMENT '产品价格',
  `bid` int(11) NOT NULL COMMENT '商家id',
  `lovenum` int(11) NOT NULL DEFAULT '0' COMMENT '收藏人数',
  PRIMARY KEY (`id`),
  KEY `p_status` (`status`,`createtime`),
  KEY `p_status_2` (`status`,`tid`),
  KEY `createtime` (`createtime`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `p_prods` */

insert  into `p_prods`(`id`,`name`,`info`,`status`,`createtime`,`updatetime`,`confirmtime`,`tid`,`price`,`bid`,`lovenum`) values (1,'IPhone 6S','我是一个华丽的Iphone 6S',0,'2015-12-16 14:43:52',NULL,NULL,25,'5000.00',1,0),(2,'Apple 12寸笔记本电脑','Apple MacBook 12英寸笔记本电脑 金色 256GB闪存 MK4M2CH/A',0,'2015-12-16 14:49:23',NULL,NULL,26,'9000.00',1,0),(3,'九美狐黑色连衣裙','2015冬装新款女装黑色蕾丝修身长袖大码超长款冬季连衣裙秋冬长裙',0,'2015-12-16 14:54:22',NULL,NULL,14,'188.00',2,0),(4,'测试商品','测试商品',0,'2016-02-16 09:10:11',NULL,NULL,14,'1.00',1,0);

/*Table structure for table `p_strategy` */

DROP TABLE IF EXISTS `p_strategy`;

CREATE TABLE `p_strategy` (
  `id` int(20) NOT NULL AUTO_INCREMENT COMMENT '策略id',
  `begindate` date NOT NULL COMMENT '开始日期',
  `enddate` date NOT NULL COMMENT '结束日期',
  `pid` int(11) NOT NULL COMMENT '产品id',
  `status` int(2) NOT NULL DEFAULT '1' COMMENT '状态',
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updatetime` timestamp NULL DEFAULT NULL COMMENT '修改时间',
  `confirmtime` timestamp NULL DEFAULT NULL COMMENT '审核时间',
  `max_count` int(11) NOT NULL COMMENT '单用户最多参与次数',
  `min_count` int(11) NOT NULL COMMENT '单用户最低参与次数',
  `prod_price` decimal(18,2) NOT NULL COMMENT '最终价',
  `begin_price` decimal(18,2) NOT NULL COMMENT '起价',
  `personNums` int(8) NOT NULL COMMENT '最多参与人次',
  `timesNums` int(8) NOT NULL COMMENT '最多期数',
  `max_process` float NOT NULL COMMENT '最大完成进度',
  `isbegin` int(1) NOT NULL DEFAULT '0' COMMENT '是否已经开始，1是，0否',
  PRIMARY KEY (`id`),
  KEY `begindate` (`begindate`,`enddate`,`status`),
  KEY `status` (`status`,`isbegin`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `p_strategy` */

insert  into `p_strategy`(`id`,`begindate`,`enddate`,`pid`,`status`,`createtime`,`updatetime`,`confirmtime`,`max_count`,`min_count`,`prod_price`,`begin_price`,`personNums`,`timesNums`,`max_process`,`isbegin`) values (1,'2015-12-15','2017-03-01',1,0,'2015-12-16 14:41:26',NULL,NULL,0,1,'5288.00','1.00',0,0,0,1),(2,'2015-12-15','2017-03-01',2,0,'2015-12-16 14:47:37',NULL,NULL,0,1,'9888.00','1.00',0,0,0,1),(3,'2015-12-15','2017-03-01',3,0,'2015-12-16 14:54:50',NULL,NULL,0,1,'288.00','1.00',0,0,0,1),(4,'2015-12-15','2017-03-01',4,0,'2016-02-16 09:10:49',NULL,NULL,0,1,'1.00','1.00',0,0,0,1);

/*Table structure for table `p_type` */

DROP TABLE IF EXISTS `p_type`;

CREATE TABLE `p_type` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '类型id',
  `name` varchar(6) NOT NULL COMMENT '类型名称',
  `status` int(2) DEFAULT NULL COMMENT '状态',
  `pid` int(11) NOT NULL DEFAULT '0' COMMENT '父类型id',
  PRIMARY KEY (`id`),
  KEY `pid` (`pid`)
) ENGINE=InnoDB AUTO_INCREMENT=62 DEFAULT CHARSET=utf8;

/*Data for the table `p_type` */

insert  into `p_type`(`id`,`name`,`status`,`pid`) values (1,'精品女装',0,0),(2,'时尚男装',0,0),(3,'数码家电',0,0),(4,'母婴玩具',0,0),(5,'居家百货',0,0),(6,'美妆护肤',0,0),(7,'鞋靴箱包 ',0,0),(8,'可口美食',0,0),(9,'精美童装',0,0),(10,'流行配饰',0,0),(11,'裙装',0,1),(12,'上衣',0,1),(13,'套装',0,1),(14,'连衣裙',0,1),(15,'长裤',0,1),(16,'内衣',0,1),(17,'泳衣',0,1),(18,'短裤',0,1),(19,'袜子',0,1),(20,'上衣',0,2),(21,'衬衫',0,2),(22,'长裤',0,2),(23,'短裤',0,2),(24,'袜子',0,2),(25,'手机',0,3),(26,'电脑',0,3),(27,'数码配件',0,3),(28,'音响耳机',0,3),(29,'厨房电器',0,3),(30,'生活家电',0,3),(31,'数码',0,3),(32,'玩具',0,4),(33,'孕妈必备',0,4),(34,'婴儿用品',0,4),(35,'居家百货',0,5),(36,'家纺',0,5),(37,'卫生用品',0,5),(38,'美容护肤',0,6),(39,'香氛精油',0,6),(40,'纤体塑身',0,6),(41,'美发造型',0,6),(42,'彩妆',0,6),(43,'女鞋',0,7),(44,'男鞋',0,7),(45,'运动鞋',0,7),(46,'休闲鞋',0,7),(47,'潮流女包',0,7),(48,'精品男包',0,7),(49,'旅行箱',0,7),(50,'帽子',0,7),(51,'围巾',0,7),(52,'手套',0,7),(53,'休闲食品',0,8),(54,'坚果蜜饯',0,8),(55,'营养生鲜',0,8),(56,'油粮干货',0,8),(57,'男童',0,9),(58,'女童',0,9),(59,'首饰',0,10),(60,'手表',0,10),(61,'服装配饰',0,10);

/*Table structure for table `s_area` */

DROP TABLE IF EXISTS `s_area`;

CREATE TABLE `s_area` (
  `id` varchar(6) NOT NULL COMMENT '省市县代码',
  `pid` varchar(6) NOT NULL DEFAULT '0' COMMENT '省市县父代码',
  `name` varchar(20) NOT NULL COMMENT '省市县名称',
  `level` int(1) NOT NULL DEFAULT '1' COMMENT '级别，0省1市2区县',
  `status` int(1) NOT NULL DEFAULT '1' COMMENT '状态',
  KEY `id` (`id`),
  KEY `id_2` (`id`,`status`),
  KEY `pid` (`pid`,`status`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `s_area` */

insert  into `s_area`(`id`,`pid`,`name`,`level`,`status`) values ('110000','0','北京市',0,0),('110101','110000','东城区',1,0),('110102','110000','西城区',1,0),('110105','110000','朝阳区',1,0),('110106','110000','丰台区',1,0),('110107','110000','石景山区',1,0),('110108','110000','海淀区',1,0),('110109','110000','门头沟区',1,0),('110111','110000','房山区',1,0),('110112','110000','通州区',1,0),('110113','110000','顺义区',1,0),('110114','110000','昌平区',1,0),('110115','110000','大兴区',1,0),('110116','110000','怀柔区',1,0),('110117','110000','平谷区',1,0),('110228','110000','密云县',1,0),('110229','110000','延庆县',1,0),('120000','0','天津市',0,0),('120101','120000','和平区',1,0),('120102','120000','河东区',1,0),('120103','120000','河西区',1,0),('120104','120000','南开区',1,0),('120105','120000','河北区',1,0),('120106','120000','红桥区',1,0),('120110','120000','东丽区',1,0),('120111','120000','西青区',1,0),('120112','120000','津南区',1,0),('120113','120000','北辰区',1,0),('120114','120000','武清区',1,0),('120115','120000','宝坻区',1,0),('120116','120000','滨海新区',1,0),('120221','120000','宁河县',1,0),('120223','120000','静海县',1,0),('120225','120000','蓟县',1,0),('130000','0','河北省',0,0),('130100','130000','石家庄市',1,0),('130102','130100','长安区',2,0),('130104','130100','桥西区',2,0),('130105','130100','新华区',2,0),('130107','130100','井陉矿区',2,0),('130108','130100','裕华区',2,0),('130109','130100','藁城区',2,0),('130110','130100','鹿泉区',2,0),('130111','130100','栾城区',2,0),('130121','130100','井陉县',2,0),('130123','130100','正定县',2,0),('130125','130100','行唐县',2,0),('130126','130100','灵寿县',2,0),('130127','130100','高邑县',2,0),('130128','130100','深泽县',2,0),('130129','130100','赞皇县',2,0),('130130','130100','无极县',2,0),('130131','130100','平山县',2,0),('130132','130100','元氏县',2,0),('130133','130100','赵县',2,0),('130181','130100','辛集市',2,0),('130183','130100','晋州市',2,0),('130184','130100','新乐市',2,0),('130200','130000','唐山市',1,0),('130202','130200','路南区',2,0),('130203','130200','路北区',2,0),('130204','130200','古冶区',2,0),('130205','130200','开平区',2,0),('130207','130200','丰南区',2,0),('130208','130200','丰润区',2,0),('130209','130200','曹妃甸区',2,0),('130223','130200','滦县',2,0),('130224','130200','滦南县',2,0),('130225','130200','乐亭县',2,0),('130227','130200','迁西县',2,0),('130229','130200','玉田县',2,0),('130281','130200','遵化市',2,0),('130283','130200','迁安市',2,0),('130300','130000','秦皇岛市',1,0),('130302','130300','海港区',2,0),('130303','130300','山海关区',2,0),('130304','130300','北戴河区',2,0),('130321','130300','青龙满族自治县',2,0),('130322','130300','昌黎县',2,0),('130323','130300','抚宁县',2,0),('130324','130300','卢龙县',2,0),('130400','130000','邯郸市',1,0),('130402','130400','邯山区',2,0),('130403','130400','丛台区',2,0),('130404','130400','复兴区',2,0),('130406','130400','峰峰矿区',2,0),('130421','130400','邯郸县',2,0),('130423','130400','临漳县',2,0),('130424','130400','成安县',2,0),('130425','130400','大名县',2,0),('130426','130400','涉县',2,0),('130427','130400','磁县',2,0),('130428','130400','肥乡县',2,0),('130429','130400','永年县',2,0),('130430','130400','邱县',2,0),('130431','130400','鸡泽县',2,0),('130432','130400','广平县',2,0),('130433','130400','馆陶县',2,0),('130434','130400','魏县',2,0),('130435','130400','曲周县',2,0),('130481','130400','武安市',2,0),('130500','130000','邢台市',1,0),('130502','130500','桥东区',2,0),('130503','130500','桥西区',2,0),('130521','130500','邢台县',2,0),('130522','130500','临城县',2,0),('130523','130500','内丘县',2,0),('130524','130500','柏乡县',2,0),('130525','130500','隆尧县',2,0),('130526','130500','任县',2,0),('130527','130500','南和县',2,0),('130528','130500','宁晋县',2,0),('130529','130500','巨鹿县',2,0),('130530','130500','新河县',2,0),('130531','130500','广宗县',2,0),('130532','130500','平乡县',2,0),('130533','130500','威县',2,0),('130534','130500','清河县',2,0),('130535','130500','临西县',2,0),('130581','130500','南宫市',2,0),('130582','130500','沙河市',2,0),('130600','130000','保定市',1,0),('130602','130600','新市区',2,0),('130603','130600','北市区',2,0),('130604','130600','南市区',2,0),('130621','130600','满城县',2,0),('130622','130600','清苑县',2,0),('130623','130600','涞水县',2,0),('130624','130600','阜平县',2,0),('130625','130600','徐水县',2,0),('130626','130600','定兴县',2,0),('130627','130600','唐县',2,0),('130628','130600','高阳县',2,0),('130629','130600','容城县',2,0),('130630','130600','涞源县',2,0),('130631','130600','望都县',2,0),('130632','130600','安新县',2,0),('130633','130600','易县',2,0),('130634','130600','曲阳县',2,0),('130635','130600','蠡县',2,0),('130636','130600','顺平县',2,0),('130637','130600','博野县',2,0),('130638','130600','雄县',2,0),('130681','130600','涿州市',2,0),('130682','130600','定州市',2,0),('130683','130600','安国市',2,0),('130684','130600','高碑店市',2,0),('130700','130000','张家口市',1,0),('130702','130700','桥东区',2,0),('130703','130700','桥西区',2,0),('130705','130700','宣化区',2,0),('130706','130700','下花园区',2,0),('130721','130700','宣化县',2,0),('130722','130700','张北县',2,0),('130723','130700','康保县',2,0),('130724','130700','沽源县',2,0),('130725','130700','尚义县',2,0),('130726','130700','蔚县',2,0),('130727','130700','阳原县',2,0),('130728','130700','怀安县',2,0),('130729','130700','万全县',2,0),('130730','130700','怀来县',2,0),('130731','130700','涿鹿县',2,0),('130732','130700','赤城县',2,0),('130733','130700','崇礼县',2,0),('130800','130000','承德市',1,0),('130802','130800','双桥区',2,0),('130803','130800','双滦区',2,0),('130804','130800','鹰手营子矿区',2,0),('130821','130800','承德县',2,0),('130822','130800','兴隆县',2,0),('130823','130800','平泉县',2,0),('130824','130800','滦平县',2,0),('130825','130800','隆化县',2,0),('130826','130800','丰宁满族自治县',2,0),('130827','130800','宽城满族自治县',2,0),('130828','130800','围场满族蒙古族自治县',2,0),('130900','130000','沧州市',1,0),('130902','130900','新华区',2,0),('130903','130900','运河区',2,0),('130921','130900','沧县',2,0),('130922','130900','青县',2,0),('130923','130900','东光县',2,0),('130924','130900','海兴县',2,0),('130925','130900','盐山县',2,0),('130926','130900','肃宁县',2,0),('130927','130900','南皮县',2,0),('130928','130900','吴桥县',2,0),('130929','130900','献县',2,0),('130930','130900','孟村回族自治县',2,0),('130981','130900','泊头市',2,0),('130982','130900','任丘市',2,0),('130983','130900','黄骅市',2,0),('130984','130900','河间市',2,0),('131000','130000','廊坊市',1,0),('131002','131000','安次区',2,0),('131003','131000','广阳区',2,0),('131022','131000','固安县',2,0),('131023','131000','永清县',2,0),('131024','131000','香河县',2,0),('131025','131000','大城县',2,0),('131026','131000','文安县',2,0),('131028','131000','大厂回族自治县',2,0),('131081','131000','霸州市',2,0),('131082','131000','三河市',2,0),('131100','130000','衡水市',1,0),('131102','131100','桃城区',2,0),('131121','131100','枣强县',2,0),('131122','131100','武邑县',2,0),('131123','131100','武强县',2,0),('131124','131100','饶阳县',2,0),('131125','131100','安平县',2,0),('131126','131100','故城县',2,0),('131127','131100','景县',2,0),('131128','131100','阜城县',2,0),('131181','131100','冀州市',2,0),('131182','131100','深州市',2,0),('140000','0','山西省',0,0),('140100','140000','太原市',1,0),('140105','140100','小店区',2,0),('140106','140100','迎泽区',2,0),('140107','140100','杏花岭区',2,0),('140108','140100','尖草坪区',2,0),('140109','140100','万柏林区',2,0),('140110','140100','晋源区',2,0),('140121','140100','清徐县',2,0),('140122','140100','阳曲县',2,0),('140123','140100','娄烦县',2,0),('140181','140100','古交市',2,0),('140200','140000','大同市',1,0),('140202','140200','城区',2,0),('140203','140200','矿区',2,0),('140211','140200','南郊区',2,0),('140212','140200','新荣区',2,0),('140221','140200','阳高县',2,0),('140222','140200','天镇县',2,0),('140223','140200','广灵县',2,0),('140224','140200','灵丘县',2,0),('140225','140200','浑源县',2,0),('140226','140200','左云县',2,0),('140227','140200','大同县',2,0),('140300','140000','阳泉市',1,0),('140302','140300','城区',2,0),('140303','140300','矿区',2,0),('140311','140300','郊区',2,0),('140321','140300','平定县',2,0),('140322','140300','盂县',2,0),('140400','140000','长治市',1,0),('140402','140400','城区',2,0),('140411','140400','郊区',2,0),('140421','140400','长治县',2,0),('140423','140400','襄垣县',2,0),('140424','140400','屯留县',2,0),('140425','140400','平顺县',2,0),('140426','140400','黎城县',2,0),('140427','140400','壶关县',2,0),('140428','140400','长子县',2,0),('140429','140400','武乡县',2,0),('140430','140400','沁县',2,0),('140431','140400','沁源县',2,0),('140481','140400','潞城市',2,0),('140500','140000','晋城市',1,0),('140502','140500','城区',2,0),('140521','140500','沁水县',2,0),('140522','140500','阳城县',2,0),('140524','140500','陵川县',2,0),('140525','140500','泽州县',2,0),('140581','140500','高平市',2,0),('140600','140000','朔州市',1,0),('140602','140600','朔城区',2,0),('140603','140600','平鲁区',2,0),('140621','140600','山阴县',2,0),('140622','140600','应县',2,0),('140623','140600','右玉县',2,0),('140624','140600','怀仁县',2,0),('140700','140000','晋中市',1,0),('140702','140700','榆次区',2,0),('140721','140700','榆社县',2,0),('140722','140700','左权县',2,0),('140723','140700','和顺县',2,0),('140724','140700','昔阳县',2,0),('140725','140700','寿阳县',2,0),('140726','140700','太谷县',2,0),('140727','140700','祁县',2,0),('140728','140700','平遥县',2,0),('140729','140700','灵石县',2,0),('140781','140700','介休市',2,0),('140800','140000','运城市',1,0),('140802','140800','盐湖区',2,0),('140821','140800','临猗县',2,0),('140822','140800','万荣县',2,0),('140823','140800','闻喜县',2,0),('140824','140800','稷山县',2,0),('140825','140800','新绛县',2,0),('140826','140800','绛县',2,0),('140827','140800','垣曲县',2,0),('140828','140800','夏县',2,0),('140829','140800','平陆县',2,0),('140830','140800','芮城县',2,0),('140881','140800','永济市',2,0),('140882','140800','河津市',2,0),('140900','140000','忻州市',1,0),('140902','140900','忻府区',2,0),('140921','140900','定襄县',2,0),('140922','140900','五台县',2,0),('140923','140900','代县',2,0),('140924','140900','繁峙县',2,0),('140925','140900','宁武县',2,0),('140926','140900','静乐县',2,0),('140927','140900','神池县',2,0),('140928','140900','五寨县',2,0),('140929','140900','岢岚县',2,0),('140930','140900','河曲县',2,0),('140931','140900','保德县',2,0),('140932','140900','偏关县',2,0),('140981','140900','原平市',2,0),('141000','140000','临汾市',1,0),('141002','141000','尧都区',2,0),('141021','141000','曲沃县',2,0),('141022','141000','翼城县',2,0),('141023','141000','襄汾县',2,0),('141024','141000','洪洞县',2,0),('141025','141000','古县',2,0),('141026','141000','安泽县',2,0),('141027','141000','浮山县',2,0),('141028','141000','吉县',2,0),('141029','141000','乡宁县',2,0),('141030','141000','大宁县',2,0),('141031','141000','隰县',2,0),('141032','141000','永和县',2,0),('141033','141000','蒲县',2,0),('141034','141000','汾西县',2,0),('141081','141000','侯马市',2,0),('141082','141000','霍州市',2,0),('141100','140000','吕梁市',1,0),('141102','141100','离石区',2,0),('141121','141100','文水县',2,0),('141122','141100','交城县',2,0),('141123','141100','兴县',2,0),('141124','141100','临县',2,0),('141125','141100','柳林县',2,0),('141126','141100','石楼县',2,0),('141127','141100','岚县',2,0),('141128','141100','方山县',2,0),('141129','141100','中阳县',2,0),('141130','141100','交口县',2,0),('141181','141100','孝义市',2,0),('141182','141100','汾阳市',2,0),('150000','0','内蒙古自治区',0,0),('150100','150000','呼和浩特市',1,0),('150102','150100','新城区',2,0),('150103','150100','回民区',2,0),('150104','150100','玉泉区',2,0),('150105','150100','赛罕区',2,0),('150121','150100','土默特左旗',2,0),('150122','150100','托克托县',2,0),('150123','150100','和林格尔县',2,0),('150124','150100','清水河县',2,0),('150125','150100','武川县',2,0),('150200','150000','包头市',1,0),('150202','150200','东河区',2,0),('150203','150200','昆都仑区',2,0),('150204','150200','青山区',2,0),('150205','150200','石拐区',2,0),('150206','150200','白云鄂博矿区',2,0),('150207','150200','九原区',2,0),('150221','150200','土默特右旗',2,0),('150222','150200','固阳县',2,0),('150223','150200','达尔罕茂明安联合旗',2,0),('150300','150000','乌海市',1,0),('150302','150300','海勃湾区',2,0),('150303','150300','海南区',2,0),('150304','150300','乌达区',2,0),('150400','150000','赤峰市',1,0),('150402','150400','红山区',2,0),('150403','150400','元宝山区',2,0),('150404','150400','松山区',2,0),('150421','150400','阿鲁科尔沁旗',2,0),('150422','150400','巴林左旗',2,0),('150423','150400','巴林右旗',2,0),('150424','150400','林西县',2,0),('150425','150400','克什克腾旗',2,0),('150426','150400','翁牛特旗',2,0),('150428','150400','喀喇沁旗',2,0),('150429','150400','宁城县',2,0),('150430','150400','敖汉旗',2,0),('150500','150000','通辽市',1,0),('150502','150500','科尔沁区',2,0),('150521','150500','科尔沁左翼中旗',2,0),('150522','150500','科尔沁左翼后旗',2,0),('150523','150500','开鲁县',2,0),('150524','150500','库伦旗',2,0),('150525','150500','奈曼旗',2,0),('150526','150500','扎鲁特旗',2,0),('150581','150500','霍林郭勒市',2,0),('150600','150000','鄂尔多斯市',1,0),('150602','150600','东胜区',2,0),('150621','150600','达拉特旗',2,0),('150622','150600','准格尔旗',2,0),('150623','150600','鄂托克前旗',2,0),('150624','150600','鄂托克旗',2,0),('150625','150600','杭锦旗',2,0),('150626','150600','乌审旗',2,0),('150627','150600','伊金霍洛旗',2,0),('150700','150000','呼伦贝尔市',1,0),('150702','150700','海拉尔区',2,0),('150703','150700','扎赉诺尔区',2,0),('150721','150700','阿荣旗',2,0),('150722','150700','莫力达瓦达斡尔族自治旗',2,0),('150723','150700','鄂伦春自治旗',2,0),('150724','150700','鄂温克族自治旗',2,0),('150725','150700','陈巴尔虎旗',2,0),('150726','150700','新巴尔虎左旗',2,0),('150727','150700','新巴尔虎右旗',2,0),('150781','150700','满洲里市',2,0),('150782','150700','牙克石市',2,0),('150783','150700','扎兰屯市',2,0),('150784','150700','额尔古纳市',2,0),('150785','150700','根河市',2,0),('150800','150000','巴彦淖尔市',1,0),('150802','150800','临河区',2,0),('150821','150800','五原县',2,0),('150822','150800','磴口县',2,0),('150823','150800','乌拉特前旗',2,0),('150824','150800','乌拉特中旗',2,0),('150825','150800','乌拉特后旗',2,0),('150826','150800','杭锦后旗',2,0),('150900','150000','乌兰察布市',1,0),('150902','150900','集宁区',2,0),('150921','150900','卓资县',2,0),('150922','150900','化德县',2,0),('150923','150900','商都县',2,0),('150924','150900','兴和县',2,0),('150925','150900','凉城县',2,0),('150926','150900','察哈尔右翼前旗',2,0),('150927','150900','察哈尔右翼中旗',2,0),('150928','150900','察哈尔右翼后旗',2,0),('150929','150900','四子王旗',2,0),('150981','150900','丰镇市',2,0),('152200','150000','兴安盟',1,0),('152201','152200','乌兰浩特市',2,0),('152202','152200','阿尔山市',2,0),('152221','152200','科尔沁右翼前旗',2,0),('152222','152200','科尔沁右翼中旗',2,0),('152223','152200','扎赉特旗',2,0),('152224','152200','突泉县',2,0),('152500','150000','锡林郭勒盟',1,0),('152501','152500','二连浩特市',2,0),('152502','152500','锡林浩特市',2,0),('152522','152500','阿巴嘎旗',2,0),('152523','152500','苏尼特左旗',2,0),('152524','152500','苏尼特右旗',2,0),('152525','152500','东乌珠穆沁旗',2,0),('152526','152500','西乌珠穆沁旗',2,0),('152527','152500','太仆寺旗',2,0),('152528','152500','镶黄旗',2,0),('152529','152500','正镶白旗',2,0),('152530','152500','正蓝旗',2,0),('152531','152500','多伦县',2,0),('152900','150000','阿拉善盟',1,0),('152921','152900','阿拉善左旗',2,0),('152922','152900','阿拉善右旗',2,0),('152923','152900','额济纳旗',2,0),('210000','0','辽宁省',0,0),('210100','210000','沈阳市',1,0),('210102','210100','和平区',2,0),('210103','210100','沈河区',2,0),('210104','210100','大东区',2,0),('210105','210100','皇姑区',2,0),('210106','210100','铁西区',2,0),('210111','210100','',2,0),('210112','210100','浑南区',2,0),('210113','210100','沈北新区',2,0),('210114','210100','于洪区',2,0),('210122','210100','辽中县',2,0),('210123','210100','康平县',2,0),('210124','210100','法库县',2,0),('210181','210100','新民市',2,0),('210200','210000','大连市',1,0),('210202','210200','中山区',2,0),('210203','210200','西岗区',2,0),('210204','210200','沙河口区',2,0),('210211','210200','甘井子区',2,0),('210212','210200','旅顺口区',2,0),('210213','210200','金州区',2,0),('210224','210200','长海县',2,0),('210281','210200','瓦房店市',2,0),('210282','210200','普兰店市',2,0),('210283','210200','庄河市',2,0),('210300','210000','鞍山市',1,0),('210302','210300','铁东区',2,0),('210303','210300','铁西区',2,0),('210304','210300','立山区',2,0),('210311','210300','千山区',2,0),('210321','210300','台安县',2,0),('210323','210300','岫岩满族自治县',2,0),('210381','210300','海城市',2,0),('210400','210000','抚顺市',1,0),('210402','210400','新抚区',2,0),('210403','210400','东洲区',2,0),('210404','210400','望花区',2,0),('210411','210400','顺城区',2,0),('210421','210400','抚顺县',2,0),('210422','210400','新宾满族自治县',2,0),('210423','210400','清原满族自治县',2,0),('210500','210000','本溪市',1,0),('210502','210500','平山区',2,0),('210503','210500','溪湖区',2,0),('210504','210500','明山区',2,0),('210505','210500','南芬区',2,0),('210521','210500','本溪满族自治县',2,0),('210522','210500','桓仁满族自治县',2,0),('210600','210000','丹东市',1,0),('210602','210600','元宝区',2,0),('210603','210600','振兴区',2,0),('210604','210600','振安区',2,0),('210624','210600','宽甸满族自治县',2,0),('210681','210600','东港市',2,0),('210682','210600','凤城市',2,0),('210700','210000','锦州市',1,0),('210702','210700','古塔区',2,0),('210703','210700','凌河区',2,0),('210711','210700','太和区',2,0),('210726','210700','黑山县',2,0),('210727','210700','义县',2,0),('210781','210700','凌海市',2,0),('210782','210700','北镇市',2,0),('210800','210000','营口市',1,0),('210802','210800','站前区',2,0),('210803','210800','西市区',2,0),('210804','210800','鲅鱼圈区',2,0),('210811','210800','老边区',2,0),('210881','210800','盖州市',2,0),('210882','210800','大石桥市',2,0),('210900','210000','阜新市',1,0),('210902','210900','海州区',2,0),('210903','210900','新邱区',2,0),('210904','210900','太平区',2,0),('210905','210900','清河门区',2,0),('210911','210900','细河区',2,0),('210921','210900','阜新蒙古族自治县',2,0),('210922','210900','彰武县',2,0),('211000','210000','辽阳市',1,0),('211002','211000','白塔区',2,0),('211003','211000','文圣区',2,0),('211004','211000','宏伟区',2,0),('211005','211000','弓长岭区',2,0),('211011','211000','太子河区',2,0),('211021','211000','辽阳县',2,0),('211081','211000','灯塔市',2,0),('211100','210000','盘锦市',1,0),('211102','211100','双台子区',2,0),('211103','211100','兴隆台区',2,0),('211121','211100','大洼县',2,0),('211122','211100','盘山县',2,0),('211200','210000','铁岭市',1,0),('211202','211200','银州区',2,0),('211204','211200','清河区',2,0),('211221','211200','铁岭县',2,0),('211223','211200','西丰县',2,0),('211224','211200','昌图县',2,0),('211281','211200','调兵山市',2,0),('211282','211200','开原市',2,0),('211300','210000','朝阳市',1,0),('211302','211300','双塔区',2,0),('211303','211300','龙城区',2,0),('211321','211300','朝阳县',2,0),('211322','211300','建平县',2,0),('211324','211300','喀喇沁左翼蒙古族自治县',2,0),('211381','211300','北票市',2,0),('211382','211300','凌源市',2,0),('211400','210000','葫芦岛市',1,0),('211402','211400','连山区',2,0),('211403','211400','龙港区',2,0),('211404','211400','南票区',2,0),('211421','211400','绥中县',2,0),('211422','211400','建昌县',2,0),('211481','211400','兴城市',2,0),('220000','0','吉林省',0,0),('220100','220000','长春市',1,0),('220102','220100','南关区',2,0),('220103','220100','宽城区',2,0),('220104','220100','朝阳区',2,0),('220105','220100','二道区',2,0),('220106','220100','绿园区',2,0),('220112','220100','双阳区',2,0),('220113','220100','九台区',2,0),('220122','220100','农安县',2,0),('220182','220100','榆树市',2,0),('220183','220100','德惠市',2,0),('220200','220000','吉林市',1,0),('220202','220200','昌邑区',2,0),('220203','220200','龙潭区',2,0),('220204','220200','船营区',2,0),('220211','220200','丰满区',2,0),('220221','220200','永吉县',2,0),('220281','220200','蛟河市',2,0),('220282','220200','桦甸市',2,0),('220283','220200','舒兰市',2,0),('220284','220200','磐石市',2,0),('220300','220000','四平市',1,0),('220302','220300','铁西区',2,0),('220303','220300','铁东区',2,0),('220322','220300','梨树县',2,0),('220323','220300','伊通满族自治县',2,0),('220381','220300','公主岭市',2,0),('220382','220300','双辽市',2,0),('220400','220000','辽源市',1,0),('220402','220400','龙山区',2,0),('220403','220400','西安区',2,0),('220421','220400','东丰县',2,0),('220422','220400','东辽县',2,0),('220500','220000','通化市',1,0),('220502','220500','东昌区',2,0),('220503','220500','二道江区',2,0),('220521','220500','通化县',2,0),('220523','220500','辉南县',2,0),('220524','220500','柳河县',2,0),('220581','220500','梅河口市',2,0),('220582','220500','集安市',2,0),('220600','220000','白山市',1,0),('220602','220600','浑江区',2,0),('220605','220600','江源区',2,0),('220621','220600','抚松县',2,0),('220622','220600','靖宇县',2,0),('220623','220600','长白朝鲜族自治县',2,0),('220681','220600','临江市',2,0),('220700','220000','松原市',1,0),('220702','220700','宁江区',2,0),('220721','220700','前郭尔罗斯蒙古族自治县',2,0),('220722','220700','长岭县',2,0),('220723','220700','乾安县',2,0),('220781','220700','扶余市',2,0),('220800','220000','白城市',1,0),('220802','220800','洮北区',2,0),('220821','220800','镇赉县',2,0),('220822','220800','通榆县',2,0),('220881','220800','洮南市',2,0),('220882','220800','大安市',2,0),('222400','220000','延边朝鲜族自治州',1,0),('222401','222400','延吉市',2,0),('222402','222400','图们市',2,0),('222403','222400','敦化市',2,0),('222404','222400','珲春市',2,0),('222405','222400','龙井市',2,0),('222406','222400','和龙市',2,0),('222424','222400','汪清县',2,0),('222426','222400','安图县',2,0),('230000','0','黑龙江省',0,0),('230100','230000','哈尔滨市',1,0),('230102','230100','道里区',2,0),('230103','230100','南岗区',2,0),('230104','230100','道外区',2,0),('230108','230100','平房区',2,0),('230109','230100','松北区',2,0),('230110','230100','香坊区',2,0),('230111','230100','呼兰区',2,0),('230112','230100','阿城区',2,0),('230123','230100','依兰县',2,0),('230124','230100','方正县',2,0),('230125','230100','宾县',2,0),('230126','230100','巴彦县',2,0),('230127','230100','木兰县',2,0),('230128','230100','通河县',2,0),('230129','230100','延寿县',2,0),('230182','230100','双城市',2,0),('230183','230100','尚志市',2,0),('230184','230100','五常市',2,0),('230200','230000','齐齐哈尔市',1,0),('230202','230200','龙沙区',2,0),('230203','230200','建华区',2,0),('230204','230200','铁锋区',2,0),('230205','230200','昂昂溪区',2,0),('230206','230200','富拉尔基区',2,0),('230207','230200','碾子山区',2,0),('230208','230200','梅里斯达斡尔族区',2,0),('230221','230200','龙江县',2,0),('230223','230200','依安县',2,0),('230224','230200','泰来县',2,0),('230225','230200','甘南县',2,0),('230227','230200','富裕县',2,0),('230229','230200','克山县',2,0),('230230','230200','克东县',2,0),('230231','230200','拜泉县',2,0),('230281','230200','讷河市',2,0),('230300','230000','鸡西市',1,0),('230302','230300','鸡冠区',2,0),('230303','230300','恒山区',2,0),('230304','230300','滴道区',2,0),('230305','230300','梨树区',2,0),('230306','230300','城子河区',2,0),('230307','230300','麻山区',2,0),('230321','230300','鸡东县',2,0),('230381','230300','虎林市',2,0),('230382','230300','密山市',2,0),('230400','230000','鹤岗市',1,0),('230402','230400','向阳区',2,0),('230403','230400','工农区',2,0),('230404','230400','南山区',2,0),('230405','230400','兴安区',2,0),('230406','230400','东山区',2,0),('230407','230400','兴山区',2,0),('230421','230400','萝北县',2,0),('230422','230400','绥滨县',2,0),('230500','230000','双鸭山市',1,0),('230502','230500','尖山区',2,0),('230503','230500','岭东区',2,0),('230505','230500','四方台区',2,0),('230506','230500','宝山区',2,0),('230521','230500','集贤县',2,0),('230522','230500','友谊县',2,0),('230523','230500','宝清县',2,0),('230524','230500','饶河县',2,0),('230600','230000','大庆市',1,0),('230602','230600','萨尔图区',2,0),('230603','230600','龙凤区',2,0),('230604','230600','让胡路区',2,0),('230605','230600','红岗区',2,0),('230606','230600','大同区',2,0),('230621','230600','肇州县',2,0),('230622','230600','肇源县',2,0),('230623','230600','林甸县',2,0),('230624','230600','杜尔伯特蒙古族自治县',2,0),('230700','230000','伊春市',1,0),('230702','230700','伊春区',2,0),('230703','230700','南岔区',2,0),('230704','230700','友好区',2,0),('230705','230700','西林区',2,0),('230706','230700','翠峦区',2,0),('230707','230700','新青区',2,0),('230708','230700','美溪区',2,0),('230709','230700','金山屯区',2,0),('230710','230700','五营区',2,0),('230711','230700','乌马河区',2,0),('230712','230700','汤旺河区',2,0),('230713','230700','带岭区',2,0),('230714','230700','乌伊岭区',2,0),('230715','230700','红星区',2,0),('230716','230700','上甘岭区',2,0),('230722','230700','嘉荫县',2,0),('230781','230700','铁力市',2,0),('230800','230000','佳木斯市',1,0),('230803','230800','向阳区',2,0),('230804','230800','前进区',2,0),('230805','230800','东风区',2,0),('230811','230800','郊区',2,0),('230822','230800','桦南县',2,0),('230826','230800','桦川县',2,0),('230828','230800','汤原县',2,0),('230833','230800','抚远县',2,0),('230881','230800','同江市',2,0),('230882','230800','富锦市',2,0),('230900','230000','七台河市',1,0),('230902','230900','新兴区',2,0),('230903','230900','桃山区',2,0),('230904','230900','茄子河区',2,0),('230921','230900','勃利县',2,0),('231000','230000','牡丹江市',1,0),('231002','231000','东安区',2,0),('231003','231000','阳明区',2,0),('231004','231000','爱民区',2,0),('231005','231000','西安区',2,0),('231024','231000','东宁县',2,0),('231025','231000','林口县',2,0),('231081','231000','绥芬河市',2,0),('231083','231000','海林市',2,0),('231084','231000','宁安市',2,0),('231085','231000','穆棱市',2,0),('231100','230000','黑河市',1,0),('231102','231100','爱辉区',2,0),('231121','231100','嫩江县',2,0),('231123','231100','逊克县',2,0),('231124','231100','孙吴县',2,0),('231181','231100','北安市',2,0),('231182','231100','五大连池市',2,0),('231200','230000','绥化市',1,0),('231202','231200','北林区',2,0),('231221','231200','望奎县',2,0),('231222','231200','兰西县',2,0),('231223','231200','青冈县',2,0),('231224','231200','庆安县',2,0),('231225','231200','明水县',2,0),('231226','231200','绥棱县',2,0),('231281','231200','安达市',2,0),('231282','231200','肇东市',2,0),('231283','231200','海伦市',2,0),('232700','230000','大兴安岭地区',1,0),('232721','232700','呼玛县',2,0),('232722','232700','塔河县',2,0),('232723','232700','漠河县',2,0),('310000','0','上海市',0,0),('310101','310000','黄浦区',1,0),('310104','310000','徐汇区',1,0),('310105','310000','长宁区',1,0),('310106','310000','静安区',1,0),('310107','310000','普陀区',1,0),('310108','310000','闸北区',1,0),('310109','310000','虹口区',1,0),('310110','310000','杨浦区',1,0),('310112','310000','闵行区',1,0),('310113','310000','宝山区',1,0),('310114','310000','嘉定区',1,0),('310115','310000','浦东新区',1,0),('310116','310000','金山区',1,0),('310117','310000','松江区',1,0),('310118','310000','青浦区',1,0),('310120','310000','奉贤区',1,0),('310230','310000','崇明县',1,0),('320000','0','江苏省',0,0),('320100','320000','南京市',1,0),('320102','320100','玄武区',2,0),('320104','320100','秦淮区',2,0),('320105','320100','建邺区',2,0),('320106','320100','鼓楼区',2,0),('320111','320100','浦口区',2,0),('320113','320100','栖霞区',2,0),('320114','320100','雨花台区',2,0),('320115','320100','江宁区',2,0),('320116','320100','六合区',2,0),('320117','320100','溧水区',2,0),('320118','320100','高淳区',2,0),('320200','320000','无锡市',1,0),('320202','320200','崇安区',2,0),('320203','320200','南长区',2,0),('320204','320200','北塘区',2,0),('320205','320200','锡山区',2,0),('320206','320200','惠山区',2,0),('320211','320200','滨湖区',2,0),('320281','320200','江阴市',2,0),('320282','320200','宜兴市',2,0),('320300','320000','徐州市',1,0),('320302','320300','鼓楼区',2,0),('320303','320300','云龙区',2,0),('320305','320300','贾汪区',2,0),('320311','320300','泉山区',2,0),('320312','320300','铜山区',2,0),('320321','320300','丰县',2,0),('320322','320300','沛县',2,0),('320324','320300','睢宁县',2,0),('320381','320300','新沂市',2,0),('320382','320300','邳州市',2,0),('320400','320000','常州市',1,0),('320402','320400','天宁区',2,0),('320404','320400','钟楼区',2,0),('320405','320400','戚墅堰区',2,0),('320411','320400','新北区',2,0),('320412','320400','武进区',2,0),('320481','320400','溧阳市',2,0),('320482','320400','金坛市',2,0),('320500','320000','苏州市',1,0),('320505','320500','虎丘区',2,0),('320506','320500','吴中区',2,0),('320507','320500','相城区',2,0),('320508','320500','姑苏区',2,0),('320509','320500','吴江区',2,0),('320581','320500','常熟市',2,0),('320582','320500','张家港市',2,0),('320583','320500','昆山市',2,0),('320585','320500','太仓市',2,0),('320600','320000','南通市',1,0),('320602','320600','崇川区',2,0),('320611','320600','港闸区',2,0),('320612','320600','通州区',2,0),('320621','320600','海安县',2,0),('320623','320600','如东县',2,0),('320681','320600','启东市',2,0),('320682','320600','如皋市',2,0),('320684','320600','海门市',2,0),('320700','320000','连云港市',1,0),('320703','320700','连云区',2,0),('320706','320700','海州区',2,0),('320707','320700','赣榆区',2,0),('320722','320700','东海县',2,0),('320723','320700','灌云县',2,0),('320724','320700','灌南县',2,0),('320800','320000','淮安市',1,0),('320802','320800','清河区',2,0),('320803','320800','淮安区',2,0),('320804','320800','淮阴区',2,0),('320811','320800','清浦区',2,0),('320826','320800','涟水县',2,0),('320829','320800','洪泽县',2,0),('320830','320800','盱眙县',2,0),('320831','320800','金湖县',2,0),('320900','320000','盐城市',1,0),('320902','320900','亭湖区',2,0),('320903','320900','盐都区',2,0),('320921','320900','响水县',2,0),('320922','320900','滨海县',2,0),('320923','320900','阜宁县',2,0),('320924','320900','射阳县',2,0),('320925','320900','建湖县',2,0),('320981','320900','东台市',2,0),('320982','320900','大丰市',2,0),('321000','320000','扬州市',1,0),('321002','321000','广陵区',2,0),('321003','321000','邗江区',2,0),('321012','321000','江都区',2,0),('321023','321000','宝应县',2,0),('321081','321000','仪征市',2,0),('321084','321000','高邮市',2,0),('321100','320000','镇江市',1,0),('321102','321100','京口区',2,0),('321111','321100','润州区',2,0),('321112','321100','丹徒区',2,0),('321181','321100','丹阳市',2,0),('321182','321100','扬中市',2,0),('321183','321100','句容市',2,0),('321200','320000','泰州市',1,0),('321202','321200','海陵区',2,0),('321203','321200','高港区',2,0),('321204','321200','姜堰区',2,0),('321281','321200','兴化市',2,0),('321282','321200','靖江市',2,0),('321283','321200','泰兴市',2,0),('321300','320000','宿迁市',1,0),('321302','321300','宿城区',2,0),('321311','321300','宿豫区',2,0),('321322','321300','沭阳县',2,0),('321323','321300','泗阳县',2,0),('321324','321300','泗洪县',2,0),('330000','0','浙江省',0,0),('330100','330000','杭州市',1,0),('330102','330100','上城区',2,0),('330103','330100','下城区',2,0),('330104','330100','江干区',2,0),('330105','330100','拱墅区',2,0),('330106','330100','西湖区',2,0),('330108','330100','滨江区',2,0),('330109','330100','萧山区',2,0),('330110','330100','余杭区',2,0),('330122','330100','桐庐县',2,0),('330127','330100','淳安县',2,0),('330182','330100','建德市',2,0),('330183','330100','富阳市',2,0),('330185','330100','临安市',2,0),('330200','330000','宁波市',1,0),('330203','330200','海曙区',2,0),('330204','330200','江东区',2,0),('330205','330200','江北区',2,0),('330206','330200','北仑区',2,0),('330211','330200','镇海区',2,0),('330212','330200','鄞州区',2,0),('330225','330200','象山县',2,0),('330226','330200','宁海县',2,0),('330281','330200','余姚市',2,0),('330282','330200','慈溪市',2,0),('330283','330200','奉化市',2,0),('330300','330000','温州市',1,0),('330302','330300','鹿城区',2,0),('330303','330300','龙湾区',2,0),('330304','330300','瓯海区',2,0),('330322','330300','洞头县',2,0),('330324','330300','永嘉县',2,0),('330326','330300','平阳县',2,0),('330327','330300','苍南县',2,0),('330328','330300','文成县',2,0),('330329','330300','泰顺县',2,0),('330381','330300','瑞安市',2,0),('330382','330300','乐清市',2,0),('330400','330000','嘉兴市',1,0),('330402','330400','南湖区',2,0),('330411','330400','秀洲区',2,0),('330421','330400','嘉善县',2,0),('330424','330400','海盐县',2,0),('330481','330400','海宁市',2,0),('330482','330400','平湖市',2,0),('330483','330400','桐乡市',2,0),('330500','330000','湖州市',1,0),('330502','330500','吴兴区',2,0),('330503','330500','南浔区',2,0),('330521','330500','德清县',2,0),('330522','330500','长兴县',2,0),('330523','330500','安吉县',2,0),('330600','330000','绍兴市',1,0),('330602','330600','越城区',2,0),('330603','330600','柯桥区',2,0),('330604','330600','上虞区',2,0),('330624','330600','新昌县',2,0),('330681','330600','诸暨市',2,0),('330683','330600','嵊州市',2,0),('330700','330000','金华市',1,0),('330702','330700','婺城区',2,0),('330703','330700','金东区',2,0),('330723','330700','武义县',2,0),('330726','330700','浦江县',2,0),('330727','330700','磐安县',2,0),('330781','330700','兰溪市',2,0),('330782','330700','义乌市',2,0),('330783','330700','东阳市',2,0),('330784','330700','永康市',2,0),('330800','330000','衢州市',1,0),('330802','330800','柯城区',2,0),('330803','330800','衢江区',2,0),('330822','330800','常山县',2,0),('330824','330800','开化县',2,0),('330825','330800','龙游县',2,0),('330881','330800','江山市',2,0),('330900','330000','舟山市',1,0),('330902','330900','定海区',2,0),('330903','330900','普陀区',2,0),('330921','330900','岱山县',2,0),('330922','330900','嵊泗县',2,0),('331000','330000','台州市',1,0),('331002','331000','椒江区',2,0),('331003','331000','黄岩区',2,0),('331004','331000','路桥区',2,0),('331021','331000','玉环县',2,0),('331022','331000','三门县',2,0),('331023','331000','天台县',2,0),('331024','331000','仙居县',2,0),('331081','331000','温岭市',2,0),('331082','331000','临海市',2,0),('331100','330000','丽水市',1,0),('331102','331100','莲都区',2,0),('331121','331100','青田县',2,0),('331122','331100','缙云县',2,0),('331123','331100','遂昌县',2,0),('331124','331100','松阳县',2,0),('331125','331100','云和县',2,0),('331126','331100','庆元县',2,0),('331127','331100','景宁畲族自治县',2,0),('331181','331100','龙泉市',2,0),('340000','0','安徽省',0,0),('340100','340000','合肥市',1,0),('340102','340100','瑶海区',2,0),('340103','340100','庐阳区',2,0),('340104','340100','蜀山区',2,0),('340111','340100','包河区',2,0),('340121','340100','长丰县',2,0),('340122','340100','肥东县',2,0),('340123','340100','肥西县',2,0),('340124','340100','庐江县',2,0),('340181','340100','巢湖市',2,0),('340200','340000','芜湖市',1,0),('340202','340200','镜湖区',2,0),('340203','340200','弋江区',2,0),('340207','340200','鸠江区',2,0),('340208','340200','三山区',2,0),('340221','340200','芜湖县',2,0),('340222','340200','繁昌县',2,0),('340223','340200','南陵县',2,0),('340225','340200','无为县',2,0),('340300','340000','蚌埠市',1,0),('340302','340300','龙子湖区',2,0),('340303','340300','蚌山区',2,0),('340304','340300','禹会区',2,0),('340311','340300','淮上区',2,0),('340321','340300','怀远县',2,0),('340322','340300','五河县',2,0),('340323','340300','固镇县',2,0),('340400','340000','淮南市',1,0),('340402','340400','大通区',2,0),('340403','340400','田家庵区',2,0),('340404','340400','谢家集区',2,0),('340405','340400','八公山区',2,0),('340406','340400','潘集区',2,0),('340421','340400','凤台县',2,0),('340500','340000','马鞍山市',1,0),('340503','340500','花山区',2,0),('340504','340500','雨山区',2,0),('340506','340500','博望区',2,0),('340521','340500','当涂县',2,0),('340522','340500','含山县',2,0),('340523','340500','和县',2,0),('340600','340000','淮北市',1,0),('340602','340600','杜集区',2,0),('340603','340600','相山区',2,0),('340604','340600','烈山区',2,0),('340621','340600','濉溪县',2,0),('340700','340000','铜陵市',1,0),('340702','340700','铜官山区',2,0),('340703','340700','狮子山区',2,0),('340711','340700','郊区',2,0),('340721','340700','铜陵县',2,0),('340800','340000','安庆市',1,0),('340802','340800','迎江区',2,0),('340803','340800','大观区',2,0),('340811','340800','宜秀区',2,0),('340822','340800','怀宁县',2,0),('340823','340800','枞阳县',2,0),('340824','340800','潜山县',2,0),('340825','340800','太湖县',2,0),('340826','340800','宿松县',2,0),('340827','340800','望江县',2,0),('340828','340800','岳西县',2,0),('340881','340800','桐城市',2,0),('341000','340000','黄山市',1,0),('341002','341000','屯溪区',2,0),('341003','341000','黄山区',2,0),('341004','341000','徽州区',2,0),('341021','341000','歙县',2,0),('341022','341000','休宁县',2,0),('341023','341000','黟县',2,0),('341024','341000','祁门县',2,0),('341100','340000','滁州市',1,0),('341102','341100','琅琊区',2,0),('341103','341100','南谯区',2,0),('341122','341100','来安县',2,0),('341124','341100','全椒县',2,0),('341125','341100','定远县',2,0),('341126','341100','凤阳县',2,0),('341181','341100','天长市',2,0),('341182','341100','明光市',2,0),('341200','340000','阜阳市',1,0),('341202','341200','颍州区',2,0),('341203','341200','颍东区',2,0),('341204','341200','颍泉区',2,0),('341221','341200','临泉县',2,0),('341222','341200','太和县',2,0),('341225','341200','阜南县',2,0),('341226','341200','颍上县',2,0),('341282','341200','界首市',2,0),('341300','340000','宿州市',1,0),('341302','341300','埇桥区',2,0),('341321','341300','砀山县',2,0),('341322','341300','萧县',2,0),('341323','341300','灵璧县',2,0),('341324','341300','泗县',2,0),('341500','340000','六安市',1,0),('341502','341500','金安区',2,0),('341503','341500','裕安区',2,0),('341521','341500','寿县',2,0),('341522','341500','霍邱县',2,0),('341523','341500','舒城县',2,0),('341524','341500','金寨县',2,0),('341525','341500','霍山县',2,0),('341600','340000','亳州市',1,0),('341602','341600','谯城区',2,0),('341621','341600','涡阳县',2,0),('341622','341600','蒙城县',2,0),('341623','341600','利辛县',2,0),('341700','340000','池州市',1,0),('341702','341700','贵池区',2,0),('341721','341700','东至县',2,0),('341722','341700','石台县',2,0),('341723','341700','青阳县',2,0),('341800','340000','宣城市',1,0),('341802','341800','宣州区',2,0),('341821','341800','郎溪县',2,0),('341822','341800','广德县',2,0),('341823','341800','泾县',2,0),('341824','341800','绩溪县',2,0),('341825','341800','旌德县',2,0),('341881','341800','宁国市',2,0),('350000','0','福建省',0,0),('350100','350000','福州市',1,0),('350102','350100','鼓楼区',2,0),('350103','350100','台江区',2,0),('350104','350100','仓山区',2,0),('350105','350100','马尾区',2,0),('350111','350100','晋安区',2,0),('350121','350100','闽侯县',2,0),('350122','350100','连江县',2,0),('350123','350100','罗源县',2,0),('350124','350100','闽清县',2,0),('350125','350100','永泰县',2,0),('350128','350100','平潭县',2,0),('350181','350100','福清市',2,0),('350182','350100','长乐市',2,0),('350200','350000','厦门市',1,0),('350203','350200','思明区',2,0),('350205','350200','海沧区',2,0),('350206','350200','湖里区',2,0),('350211','350200','集美区',2,0),('350212','350200','同安区',2,0),('350213','350200','翔安区',2,0),('350300','350000','莆田市',1,0),('350302','350300','城厢区',2,0),('350303','350300','涵江区',2,0),('350304','350300','荔城区',2,0),('350305','350300','秀屿区',2,0),('350322','350300','仙游县',2,0),('350400','350000','三明市',1,0),('350402','350400','梅列区',2,0),('350403','350400','三元区',2,0),('350421','350400','明溪县',2,0),('350423','350400','清流县',2,0),('350424','350400','宁化县',2,0),('350425','350400','大田县',2,0),('350426','350400','尤溪县',2,0),('350427','350400','沙县',2,0),('350428','350400','将乐县',2,0),('350429','350400','泰宁县',2,0),('350430','350400','建宁县',2,0),('350481','350400','永安市',2,0),('350500','350000','泉州市',1,0),('350502','350500','鲤城区',2,0),('350503','350500','丰泽区',2,0),('350504','350500','洛江区',2,0),('350505','350500','泉港区',2,0),('350521','350500','惠安县',2,0),('350524','350500','安溪县',2,0),('350525','350500','永春县',2,0),('350526','350500','德化县',2,0),('350527','350500','金门县',2,0),('350581','350500','石狮市',2,0),('350582','350500','晋江市',2,0),('350583','350500','南安市',2,0),('350600','350000','漳州市',1,0),('350602','350600','芗城区',2,0),('350603','350600','龙文区',2,0),('350622','350600','云霄县',2,0),('350623','350600','漳浦县',2,0),('350624','350600','诏安县',2,0),('350625','350600','长泰县',2,0),('350626','350600','东山县',2,0),('350627','350600','南靖县',2,0),('350628','350600','平和县',2,0),('350629','350600','华安县',2,0),('350681','350600','龙海市',2,0),('350700','350000','南平市',1,0),('350702','350700','延平区',2,0),('350721','350700','顺昌县',2,0),('350722','350700','浦城县',2,0),('350723','350700','光泽县',2,0),('350724','350700','松溪县',2,0),('350725','350700','政和县',2,0),('350781','350700','邵武市',2,0),('350782','350700','武夷山市',2,0),('350783','350700','建瓯市',2,0),('350784','350700','建阳市',2,0),('350800','350000','龙岩市',1,0),('350802','350800','新罗区',2,0),('350821','350800','长汀县',2,0),('350822','350800','永定县',2,0),('350823','350800','上杭县',2,0),('350824','350800','武平县',2,0),('350825','350800','连城县',2,0),('350881','350800','漳平市',2,0),('350900','350000','宁德市',1,0),('350902','350900','蕉城区',2,0),('350921','350900','霞浦县',2,0),('350922','350900','古田县',2,0),('350923','350900','屏南县',2,0),('350924','350900','寿宁县',2,0),('350925','350900','周宁县',2,0),('350926','350900','柘荣县',2,0),('350981','350900','福安市',2,0),('350982','350900','福鼎市',2,0),('360000','0','江西省',0,0),('360100','360000','南昌市',1,0),('360102','360100','东湖区',2,0),('360103','360100','西湖区',2,0),('360104','360100','青云谱区',2,0),('360105','360100','湾里区',2,0),('360111','360100','青山湖区',2,0),('360121','360100','南昌县',2,0),('360122','360100','新建县',2,0),('360123','360100','安义县',2,0),('360124','360100','进贤县',2,0),('360200','360000','景德镇市',1,0),('360202','360200','昌江区',2,0),('360203','360200','珠山区',2,0),('360222','360200','浮梁县',2,0),('360281','360200','乐平市',2,0),('360300','360000','萍乡市',1,0),('360302','360300','安源区',2,0),('360313','360300','湘东区',2,0),('360321','360300','莲花县',2,0),('360322','360300','上栗县',2,0),('360323','360300','芦溪县',2,0),('360400','360000','九江市',1,0),('360402','360400','庐山区',2,0),('360403','360400','浔阳区',2,0),('360421','360400','九江县',2,0),('360423','360400','武宁县',2,0),('360424','360400','修水县',2,0),('360425','360400','永修县',2,0),('360426','360400','德安县',2,0),('360427','360400','星子县',2,0),('360428','360400','都昌县',2,0),('360429','360400','湖口县',2,0),('360430','360400','彭泽县',2,0),('360481','360400','瑞昌市',2,0),('360482','360400','共青城市',2,0),('360500','360000','新余市',1,0),('360502','360500','渝水区',2,0),('360521','360500','分宜县',2,0),('360600','360000','鹰潭市',1,0),('360602','360600','月湖区',2,0),('360622','360600','余江县',2,0),('360681','360600','贵溪市',2,0),('360700','360000','赣州市',1,0),('360702','360700','章贡区',2,0),('360703','360700','南康区',2,0),('360721','360700','赣县',2,0),('360722','360700','信丰县',2,0),('360723','360700','大余县',2,0),('360724','360700','上犹县',2,0),('360725','360700','崇义县',2,0),('360726','360700','安远县',2,0),('360727','360700','龙南县',2,0),('360728','360700','定南县',2,0),('360729','360700','全南县',2,0),('360730','360700','宁都县',2,0),('360731','360700','于都县',2,0),('360732','360700','兴国县',2,0),('360733','360700','会昌县',2,0),('360734','360700','寻乌县',2,0),('360735','360700','石城县',2,0),('360781','360700','瑞金市',2,0),('360800','360000','吉安市',1,0),('360802','360800','吉州区',2,0),('360803','360800','青原区',2,0),('360821','360800','吉安县',2,0),('360822','360800','吉水县',2,0),('360823','360800','峡江县',2,0),('360824','360800','新干县',2,0),('360825','360800','永丰县',2,0),('360826','360800','泰和县',2,0),('360827','360800','遂川县',2,0),('360828','360800','万安县',2,0),('360829','360800','安福县',2,0),('360830','360800','永新县',2,0),('360881','360800','井冈山市',2,0),('360900','360000','宜春市',1,0),('360902','360900','袁州区',2,0),('360921','360900','奉新县',2,0),('360922','360900','万载县',2,0),('360923','360900','上高县',2,0),('360924','360900','宜丰县',2,0),('360925','360900','靖安县',2,0),('360926','360900','铜鼓县',2,0),('360981','360900','丰城市',2,0),('360982','360900','樟树市',2,0),('360983','360900','高安市',2,0),('361000','360000','抚州市',1,0),('361002','361000','临川区',2,0),('361021','361000','南城县',2,0),('361022','361000','黎川县',2,0),('361023','361000','南丰县',2,0),('361024','361000','崇仁县',2,0),('361025','361000','乐安县',2,0),('361026','361000','宜黄县',2,0),('361027','361000','金溪县',2,0),('361028','361000','资溪县',2,0),('361029','361000','东乡县',2,0),('361030','361000','广昌县',2,0),('361100','360000','上饶市',1,0),('361102','361100','信州区',2,0),('361121','361100','上饶县',2,0),('361122','361100','广丰县',2,0),('361123','361100','玉山县',2,0),('361124','361100','铅山县',2,0),('361125','361100','横峰县',2,0),('361126','361100','弋阳县',2,0),('361127','361100','余干县',2,0),('361128','361100','鄱阳县',2,0),('361129','361100','万年县',2,0),('361130','361100','婺源县',2,0),('361181','361100','德兴市',2,0),('370000','0','山东省',0,0),('370100','370000','济南市',1,0),('370102','370100','历下区',2,0),('370103','370100','市中区',2,0),('370104','370100','槐荫区',2,0),('370105','370100','天桥区',2,0),('370112','370100','历城区',2,0),('370113','370100','长清区',2,0),('370124','370100','平阴县',2,0),('370125','370100','济阳县',2,0),('370126','370100','商河县',2,0),('370181','370100','章丘市',2,0),('370200','370000','青岛市',1,0),('370202','370200','市南区',2,0),('370203','370200','市北区',2,0),('370211','370200','黄岛区',2,0),('370212','370200','崂山区',2,0),('370213','370200','李沧区',2,0),('370214','370200','城阳区',2,0),('370281','370200','胶州市',2,0),('370282','370200','即墨市',2,0),('370283','370200','平度市',2,0),('370285','370200','莱西市',2,0),('370300','370000','淄博市',1,0),('370302','370300','淄川区',2,0),('370303','370300','张店区',2,0),('370304','370300','博山区',2,0),('370305','370300','临淄区',2,0),('370306','370300','周村区',2,0),('370321','370300','桓台县',2,0),('370322','370300','高青县',2,0),('370323','370300','沂源县',2,0),('370400','370000','枣庄市',1,0),('370402','370400','市中区',2,0),('370403','370400','薛城区',2,0),('370404','370400','峄城区',2,0),('370405','370400','台儿庄区',2,0),('370406','370400','山亭区',2,0),('370481','370400','滕州市',2,0),('370500','370000','东营市',1,0),('370502','370500','东营区',2,0),('370503','370500','河口区',2,0),('370521','370500','垦利县',2,0),('370522','370500','利津县',2,0),('370523','370500','广饶县',2,0),('370600','370000','烟台市',1,0),('370602','370600','芝罘区',2,0),('370611','370600','福山区',2,0),('370612','370600','牟平区',2,0),('370613','370600','莱山区',2,0),('370634','370600','长岛县',2,0),('370681','370600','龙口市',2,0),('370682','370600','莱阳市',2,0),('370683','370600','莱州市',2,0),('370684','370600','蓬莱市',2,0),('370685','370600','招远市',2,0),('370686','370600','栖霞市',2,0),('370687','370600','海阳市',2,0),('370700','370000','潍坊市',1,0),('370702','370700','潍城区',2,0),('370703','370700','寒亭区',2,0),('370704','370700','坊子区',2,0),('370705','370700','奎文区',2,0),('370724','370700','临朐县',2,0),('370725','370700','昌乐县',2,0),('370781','370700','青州市',2,0),('370782','370700','诸城市',2,0),('370783','370700','寿光市',2,0),('370784','370700','安丘市',2,0),('370785','370700','高密市',2,0),('370786','370700','昌邑市',2,0),('370800','370000','济宁市',1,0),('370811','370800','任城区',2,0),('370812','370800','兖州区',2,0),('370826','370800','微山县',2,0),('370827','370800','鱼台县',2,0),('370828','370800','金乡县',2,0),('370829','370800','嘉祥县',2,0),('370830','370800','汶上县',2,0),('370831','370800','泗水县',2,0),('370832','370800','梁山县',2,0),('370881','370800','曲阜市',2,0),('370883','370800','邹城市',2,0),('370900','370000','泰安市',1,0),('370902','370900','泰山区',2,0),('370911','370900','岱岳区',2,0),('370921','370900','宁阳县',2,0),('370923','370900','东平县',2,0),('370982','370900','新泰市',2,0),('370983','370900','肥城市',2,0),('371000','370000','威海市',1,0),('371002','371000','环翠区',2,0),('371003','371000','文登区',2,0),('371082','371000','荣成市',2,0),('371083','371000','乳山市',2,0),('371100','370000','日照市',1,0),('371102','371100','东港区',2,0),('371103','371100','岚山区',2,0),('371121','371100','五莲县',2,0),('371122','371100','莒县',2,0),('371200','370000','莱芜市',1,0),('371202','371200','莱城区',2,0),('371203','371200','钢城区',2,0),('371300','370000','临沂市',1,0),('371302','371300','兰山区',2,0),('371311','371300','罗庄区',2,0),('371312','371300','河东区',2,0),('371321','371300','沂南县',2,0),('371322','371300','郯城县',2,0),('371323','371300','沂水县',2,0),('371324','371300','兰陵县',2,0),('371325','371300','费县',2,0),('371326','371300','平邑县',2,0),('371327','371300','莒南县',2,0),('371328','371300','蒙阴县',2,0),('371329','371300','临沭县',2,0),('371400','370000','德州市',1,0),('371402','371400','德城区',2,0),('371403','371400','陵城区',2,0),('371422','371400','宁津县',2,0),('371423','371400','庆云县',2,0),('371424','371400','临邑县',2,0),('371425','371400','齐河县',2,0),('371426','371400','平原县',2,0),('371427','371400','夏津县',2,0),('371428','371400','武城县',2,0),('371481','371400','乐陵市',2,0),('371482','371400','禹城市',2,0),('371500','370000','聊城市',1,0),('371502','371500','东昌府区',2,0),('371521','371500','阳谷县',2,0),('371522','371500','莘县',2,0),('371523','371500','茌平县',2,0),('371524','371500','东阿县',2,0),('371525','371500','冠县',2,0),('371526','371500','高唐县',2,0),('371581','371500','临清市',2,0),('371600','370000','滨州市',1,0),('371602','371600','滨城区',2,0),('371603','371600','沾化区',2,0),('371621','371600','惠民县',2,0),('371622','371600','阳信县',2,0),('371623','371600','无棣县',2,0),('371625','371600','博兴县',2,0),('371626','371600','邹平县',2,0),('371700','370000','菏泽市',1,0),('371702','371700','牡丹区',2,0),('371721','371700','曹县',2,0),('371722','371700','单县',2,0),('371723','371700','成武县',2,0),('371724','371700','巨野县',2,0),('371725','371700','郓城县',2,0),('371726','371700','鄄城县',2,0),('371727','371700','定陶县',2,0),('371728','371700','东明县',2,0),('410000','0','河南省',0,0),('410100','410000','郑州市',1,0),('410102','410100','中原区',2,0),('410103','410100','二七区',2,0),('410104','410100','管城回族区',2,0),('410105','410100','金水区',2,0),('410106','410100','上街区',2,0),('410108','410100','惠济区',2,0),('410122','410100','中牟县',2,0),('410181','410100','巩义市',2,0),('410182','410100','荥阳市',2,0),('410183','410100','新密市',2,0),('410184','410100','新郑市',2,0),('410185','410100','登封市',2,0),('410200','410000','开封市',1,0),('410202','410200','龙亭区',2,0),('410203','410200','顺河回族区',2,0),('410204','410200','鼓楼区',2,0),('410205','410200','禹王台区',2,0),('410211','410200','金明区',2,0),('410221','410200','杞县',2,0),('410222','410200','通许县',2,0),('410223','410200','尉氏县',2,0),('410224','410200','开封县',2,0),('410225','410200','兰考县',2,0),('410300','410000','洛阳市',1,0),('410302','410300','老城区',2,0),('410303','410300','西工区',2,0),('410304','410300','瀍河回族区',2,0),('410305','410300','涧西区',2,0),('410306','410300','吉利区',2,0),('410311','410300','洛龙区',2,0),('410322','410300','孟津县',2,0),('410323','410300','新安县',2,0),('410324','410300','栾川县',2,0),('410325','410300','嵩县',2,0),('410326','410300','汝阳县',2,0),('410327','410300','宜阳县',2,0),('410328','410300','洛宁县',2,0),('410329','410300','伊川县',2,0),('410381','410300','偃师市',2,0),('410400','410000','平顶山市',1,0),('410402','410400','新华区',2,0),('410403','410400','卫东区',2,0),('410404','410400','石龙区',2,0),('410411','410400','湛河区',2,0),('410421','410400','宝丰县',2,0),('410422','410400','叶县',2,0),('410423','410400','鲁山县',2,0),('410425','410400','郏县',2,0),('410481','410400','舞钢市',2,0),('410482','410400','汝州市',2,0),('410500','410000','安阳市',1,0),('410502','410500','文峰区',2,0),('410503','410500','北关区',2,0),('410505','410500','殷都区',2,0),('410506','410500','龙安区',2,0),('410522','410500','安阳县',2,0),('410523','410500','汤阴县',2,0),('410526','410500','滑县',2,0),('410527','410500','内黄县',2,0),('410581','410500','林州市',2,0),('410600','410000','鹤壁市',1,0),('410602','410600','鹤山区',2,0),('410603','410600','山城区',2,0),('410611','410600','淇滨区',2,0),('410621','410600','浚县',2,0),('410622','410600','淇县',2,0),('410700','410000','新乡市',1,0),('410702','410700','红旗区',2,0),('410703','410700','卫滨区',2,0),('410704','410700','凤泉区',2,0),('410711','410700','牧野区',2,0),('410721','410700','新乡县',2,0),('410724','410700','获嘉县',2,0),('410725','410700','原阳县',2,0),('410726','410700','延津县',2,0),('410727','410700','封丘县',2,0),('410728','410700','长垣县',2,0),('410781','410700','卫辉市',2,0),('410782','410700','辉县市',2,0),('410800','410000','焦作市',1,0),('410802','410800','解放区',2,0),('410803','410800','中站区',2,0),('410804','410800','马村区',2,0),('410811','410800','山阳区',2,0),('410821','410800','修武县',2,0),('410822','410800','博爱县',2,0),('410823','410800','武陟县',2,0),('410825','410800','温县',2,0),('410882','410800','沁阳市',2,0),('410883','410800','孟州市',2,0),('410900','410000','濮阳市',1,0),('410902','410900','华龙区',2,0),('410922','410900','清丰县',2,0),('410923','410900','南乐县',2,0),('410926','410900','范县',2,0),('410927','410900','台前县',2,0),('410928','410900','濮阳县',2,0),('411000','410000','许昌市',1,0),('411002','411000','魏都区',2,0),('411023','411000','许昌县',2,0),('411024','411000','鄢陵县',2,0),('411025','411000','襄城县',2,0),('411081','411000','禹州市',2,0),('411082','411000','长葛市',2,0),('411100','410000','漯河市',1,0),('411102','411100','源汇区',2,0),('411103','411100','郾城区',2,0),('411104','411100','召陵区',2,0),('411121','411100','舞阳县',2,0),('411122','411100','临颍县',2,0),('411200','410000','三门峡市',1,0),('411202','411200','湖滨区',2,0),('411221','411200','渑池县',2,0),('411222','411200','陕县',2,0),('411224','411200','卢氏县',2,0),('411281','411200','义马市',2,0),('411282','411200','灵宝市',2,0),('411300','410000','南阳市',1,0),('411302','411300','宛城区',2,0),('411303','411300','卧龙区',2,0),('411321','411300','南召县',2,0),('411322','411300','方城县',2,0),('411323','411300','西峡县',2,0),('411324','411300','镇平县',2,0),('411325','411300','内乡县',2,0),('411326','411300','淅川县',2,0),('411327','411300','社旗县',2,0),('411328','411300','唐河县',2,0),('411329','411300','新野县',2,0),('411330','411300','桐柏县',2,0),('411381','411300','邓州市',2,0),('411400','410000','商丘市',1,0),('411402','411400','梁园区',2,0),('411403','411400','睢阳区',2,0),('411421','411400','民权县',2,0),('411422','411400','睢县',2,0),('411423','411400','宁陵县',2,0),('411424','411400','柘城县',2,0),('411425','411400','虞城县',2,0),('411426','411400','夏邑县',2,0),('411481','411400','永城市',2,0),('411500','410000','信阳市',1,0),('411502','411500','浉河区',2,0),('411503','411500','平桥区',2,0),('411521','411500','罗山县',2,0),('411522','411500','光山县',2,0),('411523','411500','新县',2,0),('411524','411500','商城县',2,0),('411525','411500','固始县',2,0),('411526','411500','潢川县',2,0),('411527','411500','淮滨县',2,0),('411528','411500','息县',2,0),('411600','410000','周口市',1,0),('411602','411600','川汇区',2,0),('411621','411600','扶沟县',2,0),('411622','411600','西华县',2,0),('411623','411600','商水县',2,0),('411624','411600','沈丘县',2,0),('411625','411600','郸城县',2,0),('411626','411600','淮阳县',2,0),('411627','411600','太康县',2,0),('411628','411600','鹿邑县',2,0),('411681','411600','项城市',2,0),('411700','410000','驻马店市',1,0),('411702','411700','驿城区',2,0),('411721','411700','西平县',2,0),('411722','411700','上蔡县',2,0),('411723','411700','平舆县',2,0),('411724','411700','正阳县',2,0),('411725','411700','确山县',2,0),('411726','411700','泌阳县',2,0),('411727','411700','汝南县',2,0),('411728','411700','遂平县',2,0),('411729','411700','新蔡县',2,0),('419000','410000','省直辖县级行政区划',1,0),('419001','419000','济源市',2,0),('420000','0','湖北省',0,0),('420100','420000','武汉市',1,0),('420102','420100','江岸区',2,0),('420103','420100','江汉区',2,0),('420104','420100','硚口区',2,0),('420105','420100','汉阳区',2,0),('420106','420100','武昌区',2,0),('420107','420100','青山区',2,0),('420111','420100','洪山区',2,0),('420112','420100','东西湖区',2,0),('420113','420100','汉南区',2,0),('420114','420100','蔡甸区',2,0),('420115','420100','江夏区',2,0),('420116','420100','黄陂区',2,0),('420117','420100','新洲区',2,0),('420200','420000','黄石市',1,0),('420202','420200','黄石港区',2,0),('420203','420200','西塞山区',2,0),('420204','420200','下陆区',2,0),('420205','420200','铁山区',2,0),('420222','420200','阳新县',2,0),('420281','420200','大冶市',2,0),('420300','420000','十堰市',1,0),('420302','420300','茅箭区',2,0),('420303','420300','张湾区',2,0),('420304','420300','郧阳区',2,0),('420322','420300','郧西县',2,0),('420323','420300','竹山县',2,0),('420324','420300','竹溪县',2,0),('420325','420300','房县',2,0),('420381','420300','丹江口市',2,0),('420500','420000','宜昌市',1,0),('420502','420500','西陵区',2,0),('420503','420500','伍家岗区',2,0),('420504','420500','点军区',2,0),('420505','420500','猇亭区',2,0),('420506','420500','夷陵区',2,0),('420525','420500','远安县',2,0),('420526','420500','兴山县',2,0),('420527','420500','秭归县',2,0),('420528','420500','长阳土家族自治县',2,0),('420529','420500','五峰土家族自治县',2,0),('420581','420500','宜都市',2,0),('420582','420500','当阳市',2,0),('420583','420500','枝江市',2,0),('420600','420000','襄阳市',1,0),('420602','420600','襄城区',2,0),('420606','420600','樊城区',2,0),('420607','420600','襄州区',2,0),('420624','420600','南漳县',2,0),('420625','420600','谷城县',2,0),('420626','420600','保康县',2,0),('420682','420600','老河口市',2,0),('420683','420600','枣阳市',2,0),('420684','420600','宜城市',2,0),('420700','420000','鄂州市',1,0),('420702','420700','梁子湖区',2,0),('420703','420700','华容区',2,0),('420704','420700','鄂城区',2,0),('420800','420000','荆门市',1,0),('420802','420800','东宝区',2,0),('420804','420800','掇刀区',2,0),('420821','420800','京山县',2,0),('420822','420800','沙洋县',2,0),('420881','420800','钟祥市',2,0),('420900','420000','孝感市',1,0),('420902','420900','孝南区',2,0),('420921','420900','孝昌县',2,0),('420922','420900','大悟县',2,0),('420923','420900','云梦县',2,0),('420981','420900','应城市',2,0),('420982','420900','安陆市',2,0),('420984','420900','汉川市',2,0),('421000','420000','荆州市',1,0),('421002','421000','沙市区',2,0),('421003','421000','荆州区',2,0),('421022','421000','公安县',2,0),('421023','421000','监利县',2,0),('421024','421000','江陵县',2,0),('421081','421000','石首市',2,0),('421083','421000','洪湖市',2,0),('421087','421000','松滋市',2,0),('421100','420000','黄冈市',1,0),('421102','421100','黄州区',2,0),('421121','421100','团风县',2,0),('421122','421100','红安县',2,0),('421123','421100','罗田县',2,0),('421124','421100','英山县',2,0),('421125','421100','浠水县',2,0),('421126','421100','蕲春县',2,0),('421127','421100','黄梅县',2,0),('421181','421100','麻城市',2,0),('421182','421100','武穴市',2,0),('421200','420000','咸宁市',1,0),('421202','421200','咸安区',2,0),('421221','421200','嘉鱼县',2,0),('421222','421200','通城县',2,0),('421223','421200','崇阳县',2,0),('421224','421200','通山县',2,0),('421281','421200','赤壁市',2,0),('421300','420000','随州市',1,0),('421303','421300','曾都区',2,0),('421321','421300','随县',2,0),('421381','421300','广水市',2,0),('422800','420000','恩施土家族苗族自治州',1,0),('422801','422800','恩施市',2,0),('422802','422800','利川市',2,0),('422822','422800','建始县',2,0),('422823','422800','巴东县',2,0),('422825','422800','宣恩县',2,0),('422826','422800','咸丰县',2,0),('422827','422800','来凤县',2,0),('422828','422800','鹤峰县',2,0),('429000','420000','省直辖县级行政区划',1,0),('429004','429000','仙桃市',2,0),('429005','429000','潜江市',2,0),('429006','429000','天门市',2,0),('429021','429000','神农架林区',2,0),('430000','0','湖南省',0,0),('430100','430000','长沙市',1,0),('430102','430100','芙蓉区',2,0),('430103','430100','天心区',2,0),('430104','430100','岳麓区',2,0),('430105','430100','开福区',2,0),('430111','430100','雨花区',2,0),('430112','430100','望城区',2,0),('430121','430100','长沙县',2,0),('430124','430100','宁乡县',2,0),('430181','430100','浏阳市',2,0),('430200','430000','株洲市',1,0),('430202','430200','荷塘区',2,0),('430203','430200','芦淞区',2,0),('430204','430200','石峰区',2,0),('430211','430200','天元区',2,0),('430221','430200','株洲县',2,0),('430223','430200','攸县',2,0),('430224','430200','茶陵县',2,0),('430225','430200','炎陵县',2,0),('430281','430200','醴陵市',2,0),('430300','430000','湘潭市',1,0),('430302','430300','雨湖区',2,0),('430304','430300','岳塘区',2,0),('430321','430300','湘潭县',2,0),('430381','430300','湘乡市',2,0),('430382','430300','韶山市',2,0),('430400','430000','衡阳市',1,0),('430405','430400','珠晖区',2,0),('430406','430400','雁峰区',2,0),('430407','430400','石鼓区',2,0),('430408','430400','蒸湘区',2,0),('430412','430400','南岳区',2,0),('430421','430400','衡阳县',2,0),('430422','430400','衡南县',2,0),('430423','430400','衡山县',2,0),('430424','430400','衡东县',2,0),('430426','430400','祁东县',2,0),('430481','430400','耒阳市',2,0),('430482','430400','常宁市',2,0),('430500','430000','邵阳市',1,0),('430502','430500','双清区',2,0),('430503','430500','大祥区',2,0),('430511','430500','北塔区',2,0),('430521','430500','邵东县',2,0),('430522','430500','新邵县',2,0),('430523','430500','邵阳县',2,0),('430524','430500','隆回县',2,0),('430525','430500','洞口县',2,0),('430527','430500','绥宁县',2,0),('430528','430500','新宁县',2,0),('430529','430500','城步苗族自治县',2,0),('430581','430500','武冈市',2,0),('430600','430000','岳阳市',1,0),('430602','430600','岳阳楼区',2,0),('430603','430600','云溪区',2,0),('430611','430600','君山区',2,0),('430621','430600','岳阳县',2,0),('430623','430600','华容县',2,0),('430624','430600','湘阴县',2,0),('430626','430600','平江县',2,0),('430681','430600','汨罗市',2,0),('430682','430600','临湘市',2,0),('430700','430000','常德市',1,0),('430702','430700','武陵区',2,0),('430703','430700','鼎城区',2,0),('430721','430700','安乡县',2,0),('430722','430700','汉寿县',2,0),('430723','430700','澧县',2,0),('430724','430700','临澧县',2,0),('430725','430700','桃源县',2,0),('430726','430700','石门县',2,0),('430781','430700','津市市',2,0),('430800','430000','张家界市',1,0),('430802','430800','永定区',2,0),('430811','430800','武陵源区',2,0),('430821','430800','慈利县',2,0),('430822','430800','桑植县',2,0),('430900','430000','益阳市',1,0),('430902','430900','资阳区',2,0),('430903','430900','赫山区',2,0),('430921','430900','南县',2,0),('430922','430900','桃江县',2,0),('430923','430900','安化县',2,0),('430981','430900','沅江市',2,0),('431000','430000','郴州市',1,0),('431002','431000','北湖区',2,0),('431003','431000','苏仙区',2,0),('431021','431000','桂阳县',2,0),('431022','431000','宜章县',2,0),('431023','431000','永兴县',2,0),('431024','431000','嘉禾县',2,0),('431025','431000','临武县',2,0),('431026','431000','汝城县',2,0),('431027','431000','桂东县',2,0),('431028','431000','安仁县',2,0),('431081','431000','资兴市',2,0),('431100','430000','永州市',1,0),('431102','431100','零陵区',2,0),('431103','431100','冷水滩区',2,0),('431121','431100','祁阳县',2,0),('431122','431100','东安县',2,0),('431123','431100','双牌县',2,0),('431124','431100','道县',2,0),('431125','431100','江永县',2,0),('431126','431100','宁远县',2,0),('431127','431100','蓝山县',2,0),('431128','431100','新田县',2,0),('431129','431100','江华瑶族自治县',2,0),('431200','430000','怀化市',1,0),('431202','431200','鹤城区',2,0),('431221','431200','中方县',2,0),('431222','431200','沅陵县',2,0),('431223','431200','辰溪县',2,0),('431224','431200','溆浦县',2,0),('431225','431200','会同县',2,0),('431226','431200','麻阳苗族自治县',2,0),('431227','431200','新晃侗族自治县',2,0),('431228','431200','芷江侗族自治县',2,0),('431229','431200','靖州苗族侗族自治县',2,0),('431230','431200','通道侗族自治县',2,0),('431281','431200','洪江市',2,0),('431300','430000','娄底市',1,0),('431302','431300','娄星区',2,0),('431321','431300','双峰县',2,0),('431322','431300','新化县',2,0),('431381','431300','冷水江市',2,0),('431382','431300','涟源市',2,0),('433100','430000','湘西土家族苗族自治州',1,0),('433101','433100','吉首市',2,0),('433122','433100','泸溪县',2,0),('433123','433100','凤凰县',2,0),('433124','433100','花垣县',2,0),('433125','433100','保靖县',2,0),('433126','433100','古丈县',2,0),('433127','433100','永顺县',2,0),('433130','433100','龙山县',2,0),('440000','0','广东省',0,0),('440100','440000','广州市',1,0),('440103','440100','荔湾区',2,0),('440104','440100','越秀区',2,0),('440105','440100','海珠区',2,0),('440106','440100','天河区',2,0),('440111','440100','白云区',2,0),('440112','440100','黄埔区',2,0),('440113','440100','番禺区',2,0),('440114','440100','花都区',2,0),('440115','440100','南沙区',2,0),('440116','440100','萝岗区',2,0),('440117','440100','从化区',2,0),('440118','440100','增城区',2,0),('440200','440000','韶关市',1,0),('440203','440200','武江区',2,0),('440204','440200','浈江区',2,0),('440205','440200','曲江区',2,0),('440222','440200','始兴县',2,0),('440224','440200','仁化县',2,0),('440229','440200','翁源县',2,0),('440232','440200','乳源瑶族自治县',2,0),('440233','440200','新丰县',2,0),('440281','440200','乐昌市',2,0),('440282','440200','南雄市',2,0),('440300','440000','深圳市',1,0),('440303','440300','罗湖区',2,0),('440304','440300','福田区',2,0),('440305','440300','南山区',2,0),('440306','440300','宝安区',2,0),('440307','440300','龙岗区',2,0),('440308','440300','盐田区',2,0),('440400','440000','珠海市',1,0),('440402','440400','香洲区',2,0),('440403','440400','斗门区',2,0),('440404','440400','金湾区',2,0),('440500','440000','汕头市',1,0),('440507','440500','龙湖区',2,0),('440511','440500','金平区',2,0),('440512','440500','濠江区',2,0),('440513','440500','潮阳区',2,0),('440514','440500','潮南区',2,0),('440515','440500','澄海区',2,0),('440523','440500','南澳县',2,0),('440600','440000','佛山市',1,0),('440604','440600','禅城区',2,0),('440605','440600','南海区',2,0),('440606','440600','顺德区',2,0),('440607','440600','三水区',2,0),('440608','440600','高明区',2,0),('440700','440000','江门市',1,0),('440703','440700','蓬江区',2,0),('440704','440700','江海区',2,0),('440705','440700','新会区',2,0),('440781','440700','台山市',2,0),('440783','440700','开平市',2,0),('440784','440700','鹤山市',2,0),('440785','440700','恩平市',2,0),('440800','440000','湛江市',1,0),('440802','440800','赤坎区',2,0),('440803','440800','霞山区',2,0),('440804','440800','坡头区',2,0),('440811','440800','麻章区',2,0),('440823','440800','遂溪县',2,0),('440825','440800','徐闻县',2,0),('440881','440800','廉江市',2,0),('440882','440800','雷州市',2,0),('440883','440800','吴川市',2,0),('440900','440000','茂名市',1,0),('440902','440900','茂南区',2,0),('440904','440900','电白区',2,0),('440981','440900','高州市',2,0),('440982','440900','化州市',2,0),('440983','440900','信宜市',2,0),('441200','440000','肇庆市',1,0),('441202','441200','端州区',2,0),('441203','441200','鼎湖区',2,0),('441223','441200','广宁县',2,0),('441224','441200','怀集县',2,0),('441225','441200','封开县',2,0),('441226','441200','德庆县',2,0),('441283','441200','高要市',2,0),('441284','441200','四会市',2,0),('441300','440000','惠州市',1,0),('441302','441300','惠城区',2,0),('441303','441300','惠阳区',2,0),('441322','441300','博罗县',2,0),('441323','441300','惠东县',2,0),('441324','441300','龙门县',2,0),('441400','440000','梅州市',1,0),('441402','441400','梅江区',2,0),('441403','441400','梅县区',2,0),('441422','441400','大埔县',2,0),('441423','441400','丰顺县',2,0),('441424','441400','五华县',2,0),('441426','441400','平远县',2,0),('441427','441400','蕉岭县',2,0),('441481','441400','兴宁市',2,0),('441500','440000','汕尾市',1,0),('441502','441500','城区',2,0),('441521','441500','海丰县',2,0),('441523','441500','陆河县',2,0),('441581','441500','陆丰市',2,0),('441600','440000','河源市',1,0),('441602','441600','源城区',2,0),('441621','441600','紫金县',2,0),('441622','441600','龙川县',2,0),('441623','441600','连平县',2,0),('441624','441600','和平县',2,0),('441625','441600','东源县',2,0),('441700','440000','阳江市',1,0),('441702','441700','江城区',2,0),('441721','441700','阳西县',2,0),('441723','441700','阳东县',2,0),('441781','441700','阳春市',2,0),('441800','440000','清远市',1,0),('441802','441800','清城区',2,0),('441803','441800','清新区',2,0),('441821','441800','佛冈县',2,0),('441823','441800','阳山县',2,0),('441825','441800','连山壮族瑶族自治县',2,0),('441826','441800','连南瑶族自治县',2,0),('441881','441800','英德市',2,0),('441882','441800','连州市',2,0),('441900','440000','东莞市',1,0),('442000','440000','中山市',1,0),('445100','440000','潮州市',1,0),('445102','445100','湘桥区',2,0),('445103','445100','潮安区',2,0),('445122','445100','饶平县',2,0),('445200','440000','揭阳市',1,0),('445202','445200','榕城区',2,0),('445203','445200','揭东区',2,0),('445222','445200','揭西县',2,0),('445224','445200','惠来县',2,0),('445281','445200','普宁市',2,0),('445300','440000','云浮市',1,0),('445302','445300','云城区',2,0),('445303','445300','云安区',2,0),('445321','445300','新兴县',2,0),('445322','445300','郁南县',2,0),('445381','445300','罗定市',2,0),('450000','0','广西壮族自治区',0,0),('450100','450000','南宁市',1,0),('450102','450100','兴宁区',2,0),('450103','450100','青秀区',2,0),('450105','450100','江南区',2,0),('450107','450100','西乡塘区',2,0),('450108','450100','良庆区',2,0),('450109','450100','邕宁区',2,0),('450122','450100','武鸣县',2,0),('450123','450100','隆安县',2,0),('450124','450100','马山县',2,0),('450125','450100','上林县',2,0),('450126','450100','宾阳县',2,0),('450127','450100','横县',2,0),('450200','450000','柳州市',1,0),('450202','450200','城中区',2,0),('450203','450200','鱼峰区',2,0),('450204','450200','柳南区',2,0),('450205','450200','柳北区',2,0),('450221','450200','柳江县',2,0),('450222','450200','柳城县',2,0),('450223','450200','鹿寨县',2,0),('450224','450200','融安县',2,0),('450225','450200','融水苗族自治县',2,0),('450226','450200','三江侗族自治县',2,0),('450300','450000','桂林市',1,0),('450302','450300','秀峰区',2,0),('450303','450300','叠彩区',2,0),('450304','450300','象山区',2,0),('450305','450300','七星区',2,0),('450311','450300','雁山区',2,0),('450312','450300','临桂区',2,0),('450321','450300','阳朔县',2,0),('450323','450300','灵川县',2,0),('450324','450300','全州县',2,0),('450325','450300','兴安县',2,0),('450326','450300','永福县',2,0),('450327','450300','灌阳县',2,0),('450328','450300','龙胜各族自治县',2,0),('450329','450300','资源县',2,0),('450330','450300','平乐县',2,0),('450331','450300','荔浦县',2,0),('450332','450300','恭城瑶族自治县',2,0),('450400','450000','梧州市',1,0),('450403','450400','万秀区',2,0),('450405','450400','长洲区',2,0),('450406','450400','龙圩区',2,0),('450421','450400','苍梧县',2,0),('450422','450400','藤县',2,0),('450423','450400','蒙山县',2,0),('450481','450400','岑溪市',2,0),('450500','450000','北海市',1,0),('450502','450500','海城区',2,0),('450503','450500','银海区',2,0),('450512','450500','铁山港区',2,0),('450521','450500','合浦县',2,0),('450600','450000','防城港市',1,0),('450602','450600','港口区',2,0),('450603','450600','防城区',2,0),('450621','450600','上思县',2,0),('450681','450600','东兴市',2,0),('450700','450000','钦州市',1,0),('450702','450700','钦南区',2,0),('450703','450700','钦北区',2,0),('450721','450700','灵山县',2,0),('450722','450700','浦北县',2,0),('450800','450000','贵港市',1,0),('450802','450800','港北区',2,0),('450803','450800','港南区',2,0),('450804','450800','覃塘区',2,0),('450821','450800','平南县',2,0),('450881','450800','桂平市',2,0),('450900','450000','玉林市',1,0),('450902','450900','玉州区',2,0),('450903','450900','福绵区',2,0),('450921','450900','容县',2,0),('450922','450900','陆川县',2,0),('450923','450900','博白县',2,0),('450924','450900','兴业县',2,0),('450981','450900','北流市',2,0),('451000','450000','百色市',1,0),('451002','451000','右江区',2,0),('451021','451000','田阳县',2,0),('451022','451000','田东县',2,0),('451023','451000','平果县',2,0),('451024','451000','德保县',2,0),('451025','451000','靖西县',2,0),('451026','451000','那坡县',2,0),('451027','451000','凌云县',2,0),('451028','451000','乐业县',2,0),('451029','451000','田林县',2,0),('451030','451000','西林县',2,0),('451031','451000','隆林各族自治县',2,0),('451100','450000','贺州市',1,0),('451102','451100','八步区',2,0),('451121','451100','昭平县',2,0),('451122','451100','钟山县',2,0),('451123','451100','富川瑶族自治县',2,0),('451200','450000','河池市',1,0),('451202','451200','金城江区',2,0),('451221','451200','南丹县',2,0),('451222','451200','天峨县',2,0),('451223','451200','凤山县',2,0),('451224','451200','东兰县',2,0),('451225','451200','罗城仫佬族自治县',2,0),('451226','451200','环江毛南族自治县',2,0),('451227','451200','巴马瑶族自治县',2,0),('451228','451200','都安瑶族自治县',2,0),('451229','451200','大化瑶族自治县',2,0),('451281','451200','宜州市',2,0),('451300','450000','来宾市',1,0),('451302','451300','兴宾区',2,0),('451321','451300','忻城县',2,0),('451322','451300','象州县',2,0),('451323','451300','武宣县',2,0),('451324','451300','金秀瑶族自治县',2,0),('451381','451300','合山市',2,0),('451400','450000','崇左市',1,0),('451402','451400','江州区',2,0),('451421','451400','扶绥县',2,0),('451422','451400','宁明县',2,0),('451423','451400','龙州县',2,0),('451424','451400','大新县',2,0),('451425','451400','天等县',2,0),('451481','451400','凭祥市',2,0),('460000','0','海南省',0,0),('460100','460000','海口市',1,0),('460105','460100','秀英区',2,0),('460106','460100','龙华区',2,0),('460107','460100','琼山区',2,0),('460108','460100','美兰区',2,0),('460200','460000','三亚市',1,0),('460202','460200','海棠区',2,0),('460203','460200','吉阳区',2,0),('460204','460200','天涯区',2,0),('460205','460200','崖州区',2,0),('460300','460000','三沙市',1,0),('469000','460000','省直辖县级行政区划',1,0),('469001','469000','五指山市',2,0),('469002','469000','琼海市',2,0),('469003','469000','儋州市',2,0),('469005','469000','文昌市',2,0),('469006','469000','万宁市',2,0),('469007','469000','东方市',2,0),('469021','469000','定安县',2,0),('469022','469000','屯昌县',2,0),('469023','469000','澄迈县',2,0),('469024','469000','临高县',2,0),('469025','469000','白沙黎族自治县',2,0),('469026','469000','昌江黎族自治县',2,0),('469027','469000','乐东黎族自治县',2,0),('469028','469000','陵水黎族自治县',2,0),('469029','469000','保亭黎族苗族自治县',2,0),('469030','469000','琼中黎族苗族自治县',2,0),('500000','0','重庆市',0,0),('500101','500000','万州区',1,0),('500102','500000','涪陵区',1,0),('500103','500000','渝中区',1,0),('500104','500000','大渡口区',1,0),('500105','500000','江北区',1,0),('500106','500000','沙坪坝区',1,0),('500107','500000','九龙坡区',1,0),('500108','500000','南岸区',1,0),('500109','500000','北碚区',1,0),('500110','500000','綦江区',1,0),('500111','500000','大足区',1,0),('500112','500000','渝北区',1,0),('500113','500000','巴南区',1,0),('500114','500000','黔江区',1,0),('500115','500000','长寿区',1,0),('500116','500000','江津区',1,0),('500117','500000','合川区',1,0),('500118','500000','永川区',1,0),('500119','500000','南川区',1,0),('500120','500000','璧山区',1,0),('500151','500000','铜梁区',1,0),('500223','500000','潼南县',1,0),('500226','500000','荣昌县',1,0),('500228','500000','梁平县',1,0),('500229','500000','城口县',1,0),('500230','500000','丰都县',1,0),('500231','500000','垫江县',1,0),('500232','500000','武隆县',1,0),('500233','500000','忠县',1,0),('500234','500000','开县',1,0),('500235','500000','云阳县',1,0),('500236','500000','奉节县',1,0),('500237','500000','巫山县',1,0),('500238','500000','巫溪县',1,0),('500240','500000','石柱土家族自治县',1,0),('500241','500000','秀山土家族苗族自治县',1,0),('500242','500000','酉阳土家族苗族自治县',1,0),('500243','500000','彭水苗族土家族自治县',1,0),('510000','0','四川省',0,0),('510100','510000','成都市',1,0),('510104','510100','锦江区',2,0),('510105','510100','青羊区',2,0),('510106','510100','金牛区',2,0),('510107','510100','武侯区',2,0),('510108','510100','成华区',2,0),('510112','510100','龙泉驿区',2,0),('510113','510100','青白江区',2,0),('510114','510100','新都区',2,0),('510115','510100','温江区',2,0),('510121','510100','金堂县',2,0),('510122','510100','双流县',2,0),('510124','510100','郫县',2,0),('510129','510100','大邑县',2,0),('510131','510100','蒲江县',2,0),('510132','510100','新津县',2,0),('510181','510100','都江堰市',2,0),('510182','510100','彭州市',2,0),('510183','510100','邛崃市',2,0),('510184','510100','崇州市',2,0),('510300','510000','自贡市',1,0),('510302','510300','自流井区',2,0),('510303','510300','贡井区',2,0),('510304','510300','大安区',2,0),('510311','510300','沿滩区',2,0),('510321','510300','荣县',2,0),('510322','510300','富顺县',2,0),('510400','510000','攀枝花市',1,0),('510402','510400','东区',2,0),('510403','510400','西区',2,0),('510411','510400','仁和区',2,0),('510421','510400','米易县',2,0),('510422','510400','盐边县',2,0),('510500','510000','泸州市',1,0),('510502','510500','江阳区',2,0),('510503','510500','纳溪区',2,0),('510504','510500','龙马潭区',2,0),('510521','510500','泸县',2,0),('510522','510500','合江县',2,0),('510524','510500','叙永县',2,0),('510525','510500','古蔺县',2,0),('510600','510000','德阳市',1,0),('510603','510600','旌阳区',2,0),('510623','510600','中江县',2,0),('510626','510600','罗江县',2,0),('510681','510600','广汉市',2,0),('510682','510600','什邡市',2,0),('510683','510600','绵竹市',2,0),('510700','510000','绵阳市',1,0),('510703','510700','涪城区',2,0),('510704','510700','游仙区',2,0),('510722','510700','三台县',2,0),('510723','510700','盐亭县',2,0),('510724','510700','安县',2,0),('510725','510700','梓潼县',2,0),('510726','510700','北川羌族自治县',2,0),('510727','510700','平武县',2,0),('510781','510700','江油市',2,0),('510800','510000','广元市',1,0),('510802','510800','利州区',2,0),('510811','510800','昭化区',2,0),('510812','510800','朝天区',2,0),('510821','510800','旺苍县',2,0),('510822','510800','青川县',2,0),('510823','510800','剑阁县',2,0),('510824','510800','苍溪县',2,0),('510900','510000','遂宁市',1,0),('510903','510900','船山区',2,0),('510904','510900','安居区',2,0),('510921','510900','蓬溪县',2,0),('510922','510900','射洪县',2,0),('510923','510900','大英县',2,0),('511000','510000','内江市',1,0),('511002','511000','市中区',2,0),('511011','511000','东兴区',2,0),('511024','511000','威远县',2,0),('511025','511000','资中县',2,0),('511028','511000','隆昌县',2,0),('511100','510000','乐山市',1,0),('511102','511100','市中区',2,0),('511111','511100','沙湾区',2,0),('511112','511100','五通桥区',2,0),('511113','511100','金口河区',2,0),('511123','511100','犍为县',2,0),('511124','511100','井研县',2,0),('511126','511100','夹江县',2,0),('511129','511100','沐川县',2,0),('511132','511100','峨边彝族自治县',2,0),('511133','511100','马边彝族自治县',2,0),('511181','511100','峨眉山市',2,0),('511300','510000','南充市',1,0),('511302','511300','顺庆区',2,0),('511303','511300','高坪区',2,0),('511304','511300','嘉陵区',2,0),('511321','511300','南部县',2,0),('511322','511300','营山县',2,0),('511323','511300','蓬安县',2,0),('511324','511300','仪陇县',2,0),('511325','511300','西充县',2,0),('511381','511300','阆中市',2,0),('511400','510000','眉山市',1,0),('511402','511400','东坡区',2,0),('511421','511400','仁寿县',2,0),('511422','511400','彭山县',2,0),('511423','511400','洪雅县',2,0),('511424','511400','丹棱县',2,0),('511425','511400','青神县',2,0),('511500','510000','宜宾市',1,0),('511502','511500','翠屏区',2,0),('511503','511500','南溪区',2,0),('511521','511500','宜宾县',2,0),('511523','511500','江安县',2,0),('511524','511500','长宁县',2,0),('511525','511500','高县',2,0),('511526','511500','珙县',2,0),('511527','511500','筠连县',2,0),('511528','511500','兴文县',2,0),('511529','511500','屏山县',2,0),('511600','510000','广安市',1,0),('511602','511600','广安区',2,0),('511603','511600','前锋区',2,0),('511621','511600','岳池县',2,0),('511622','511600','武胜县',2,0),('511623','511600','邻水县',2,0),('511681','511600','华蓥市',2,0),('511700','510000','达州市',1,0),('511702','511700','通川区',2,0),('511703','511700','达川区',2,0),('511722','511700','宣汉县',2,0),('511723','511700','开江县',2,0),('511724','511700','大竹县',2,0),('511725','511700','渠县',2,0),('511781','511700','万源市',2,0),('511800','510000','雅安市',1,0),('511802','511800','雨城区',2,0),('511803','511800','名山区',2,0),('511822','511800','荥经县',2,0),('511823','511800','汉源县',2,0),('511824','511800','石棉县',2,0),('511825','511800','天全县',2,0),('511826','511800','芦山县',2,0),('511827','511800','宝兴县',2,0),('511900','510000','巴中市',1,0),('511902','511900','巴州区',2,0),('511903','511900','恩阳区',2,0),('511921','511900','通江县',2,0),('511922','511900','南江县',2,0),('511923','511900','平昌县',2,0),('512000','510000','资阳市',1,0),('512002','512000','雁江区',2,0),('512021','512000','安岳县',2,0),('512022','512000','乐至县',2,0),('512081','512000','简阳市',2,0),('513200','510000','阿坝藏族羌族自治州',1,0),('513221','513200','汶川县',2,0),('513222','513200','理县',2,0),('513223','513200','茂县',2,0),('513224','513200','松潘县',2,0),('513225','513200','九寨沟县',2,0),('513226','513200','金川县',2,0),('513227','513200','小金县',2,0),('513228','513200','黑水县',2,0),('513229','513200','马尔康县',2,0),('513230','513200','壤塘县',2,0),('513231','513200','阿坝县',2,0),('513232','513200','若尔盖县',2,0),('513233','513200','红原县',2,0),('513300','510000','甘孜藏族自治州',1,0),('513321','513300','康定县',2,0),('513322','513300','泸定县',2,0),('513323','513300','丹巴县',2,0),('513324','513300','九龙县',2,0),('513325','513300','雅江县',2,0),('513326','513300','道孚县',2,0),('513327','513300','炉霍县',2,0),('513328','513300','甘孜县',2,0),('513329','513300','新龙县',2,0),('513330','513300','德格县',2,0),('513331','513300','白玉县',2,0),('513332','513300','石渠县',2,0),('513333','513300','色达县',2,0),('513334','513300','理塘县',2,0),('513335','513300','巴塘县',2,0),('513336','513300','乡城县',2,0),('513337','513300','稻城县',2,0),('513338','513300','得荣县',2,0),('513400','510000','凉山彝族自治州',1,0),('513401','513400','西昌市',2,0),('513422','513400','木里藏族自治县',2,0),('513423','513400','盐源县',2,0),('513424','513400','德昌县',2,0),('513425','513400','会理县',2,0),('513426','513400','会东县',2,0),('513427','513400','宁南县',2,0),('513428','513400','普格县',2,0),('513429','513400','布拖县',2,0),('513430','513400','金阳县',2,0),('513431','513400','昭觉县',2,0),('513432','513400','喜德县',2,0),('513433','513400','冕宁县',2,0),('513434','513400','越西县',2,0),('513435','513400','甘洛县',2,0),('513436','513400','美姑县',2,0),('513437','513400','雷波县',2,0),('520000','0','贵州省',0,0),('520100','520000','贵阳市',1,0),('520102','520100','南明区',2,0),('520103','520100','云岩区',2,0),('520111','520100','花溪区',2,0),('520112','520100','乌当区',2,0),('520113','520100','白云区',2,0),('520115','520100','观山湖区',2,0),('520121','520100','开阳县',2,0),('520122','520100','息烽县',2,0),('520123','520100','修文县',2,0),('520181','520100','清镇市',2,0),('520200','520000','六盘水市',1,0),('520201','520200','钟山区',2,0),('520203','520200','六枝特区',2,0),('520221','520200','水城县',2,0),('520222','520200','盘县',2,0),('520300','520000','遵义市',1,0),('520302','520300','红花岗区',2,0),('520303','520300','汇川区',2,0),('520321','520300','遵义县',2,0),('520322','520300','桐梓县',2,0),('520323','520300','绥阳县',2,0),('520324','520300','正安县',2,0),('520325','520300','道真仡佬族苗族自治县',2,0),('520326','520300','务川仡佬族苗族自治县',2,0),('520327','520300','凤冈县',2,0),('520328','520300','湄潭县',2,0),('520329','520300','余庆县',2,0),('520330','520300','习水县',2,0),('520381','520300','赤水市',2,0),('520382','520300','仁怀市',2,0),('520400','520000','安顺市',1,0),('520402','520400','西秀区',2,0),('520421','520400','平坝县',2,0),('520422','520400','普定县',2,0),('520423','520400','镇宁布依族苗族自治县',2,0),('520424','520400','关岭布依族苗族自治县',2,0),('520425','520400','紫云苗族布依族自治县',2,0),('520500','520000','毕节市',1,0),('520502','520500','七星关区',2,0),('520521','520500','大方县',2,0),('520522','520500','黔西县',2,0),('520523','520500','金沙县',2,0),('520524','520500','织金县',2,0),('520525','520500','纳雍县',2,0),('520526','520500','威宁彝族回族苗族自治县',2,0),('520527','520500','赫章县',2,0),('520600','520000','铜仁市',1,0),('520602','520600','碧江区',2,0),('520603','520600','万山区',2,0),('520621','520600','江口县',2,0),('520622','520600','玉屏侗族自治县',2,0),('520623','520600','石阡县',2,0),('520624','520600','思南县',2,0),('520625','520600','印江土家族苗族自治县',2,0),('520626','520600','德江县',2,0),('520627','520600','沿河土家族自治县',2,0),('520628','520600','松桃苗族自治县',2,0),('522300','520000','黔西南布依族苗族自治州',1,0),('522301','522300','兴义市',2,0),('522322','522300','兴仁县',2,0),('522323','522300','普安县',2,0),('522324','522300','晴隆县',2,0),('522325','522300','贞丰县',2,0),('522326','522300','望谟县',2,0),('522327','522300','册亨县',2,0),('522328','522300','安龙县',2,0),('522600','520000','黔东南苗族侗族自治州',1,0),('522601','522600','凯里市',2,0),('522622','522600','黄平县',2,0),('522623','522600','施秉县',2,0),('522624','522600','三穗县',2,0),('522625','522600','镇远县',2,0),('522626','522600','岑巩县',2,0),('522627','522600','天柱县',2,0),('522628','522600','锦屏县',2,0),('522629','522600','剑河县',2,0),('522630','522600','台江县',2,0),('522631','522600','黎平县',2,0),('522632','522600','榕江县',2,0),('522633','522600','从江县',2,0),('522634','522600','雷山县',2,0),('522635','522600','麻江县',2,0),('522636','522600','丹寨县',2,0),('522700','520000','黔南布依族苗族自治州',1,0),('522701','522700','都匀市',2,0),('522702','522700','福泉市',2,0),('522722','522700','荔波县',2,0),('522723','522700','贵定县',2,0),('522725','522700','瓮安县',2,0),('522726','522700','独山县',2,0),('522727','522700','平塘县',2,0),('522728','522700','罗甸县',2,0),('522729','522700','长顺县',2,0),('522730','522700','龙里县',2,0),('522731','522700','惠水县',2,0),('522732','522700','三都水族自治县',2,0),('530000','0','云南省',0,0),('530100','530000','昆明市',1,0),('530102','530100','五华区',2,0),('530103','530100','盘龙区',2,0),('530111','530100','官渡区',2,0),('530112','530100','西山区',2,0),('530113','530100','东川区',2,0),('530114','530100','呈贡区',2,0),('530122','530100','晋宁县',2,0),('530124','530100','富民县',2,0),('530125','530100','宜良县',2,0),('530126','530100','石林彝族自治县',2,0),('530127','530100','嵩明县',2,0),('530128','530100','禄劝彝族苗族自治县',2,0),('530129','530100','寻甸回族彝族自治县',2,0),('530181','530100','安宁市',2,0),('530300','530000','曲靖市',1,0),('530302','530300','麒麟区',2,0),('530321','530300','马龙县',2,0),('530322','530300','陆良县',2,0),('530323','530300','师宗县',2,0),('530324','530300','罗平县',2,0),('530325','530300','富源县',2,0),('530326','530300','会泽县',2,0),('530328','530300','沾益县',2,0),('530381','530300','宣威市',2,0),('530400','530000','玉溪市',1,0),('530402','530400','红塔区',2,0),('530421','530400','江川县',2,0),('530422','530400','澄江县',2,0),('530423','530400','通海县',2,0),('530424','530400','华宁县',2,0),('530425','530400','易门县',2,0),('530426','530400','峨山彝族自治县',2,0),('530427','530400','新平彝族傣族自治县',2,0),('530428','530400','元江哈尼族彝族傣族自治县',2,0),('530500','530000','保山市',1,0),('530502','530500','隆阳区',2,0),('530521','530500','施甸县',2,0),('530522','530500','腾冲县',2,0),('530523','530500','龙陵县',2,0),('530524','530500','昌宁县',2,0),('530600','530000','昭通市',1,0),('530602','530600','昭阳区',2,0),('530621','530600','鲁甸县',2,0),('530622','530600','巧家县',2,0),('530623','530600','盐津县',2,0),('530624','530600','大关县',2,0),('530625','530600','永善县',2,0),('530626','530600','绥江县',2,0),('530627','530600','镇雄县',2,0),('530628','530600','彝良县',2,0),('530629','530600','威信县',2,0),('530630','530600','水富县',2,0),('530700','530000','丽江市',1,0),('530702','530700','古城区',2,0),('530721','530700','玉龙纳西族自治县',2,0),('530722','530700','永胜县',2,0),('530723','530700','华坪县',2,0),('530724','530700','宁蒗彝族自治县',2,0),('530800','530000','普洱市',1,0),('530802','530800','思茅区',2,0),('530821','530800','宁洱哈尼族彝族自治县',2,0),('530822','530800','墨江哈尼族自治县',2,0),('530823','530800','景东彝族自治县',2,0),('530824','530800','景谷傣族彝族自治县',2,0),('530825','530800','镇沅彝族哈尼族拉祜族自治县',2,0),('530826','530800','江城哈尼族彝族自治县',2,0),('530827','530800','孟连傣族拉祜族佤族自治县',2,0),('530828','530800','澜沧拉祜族自治县',2,0),('530829','530800','西盟佤族自治县',2,0),('530900','530000','临沧市',1,0),('530902','530900','临翔区',2,0),('530921','530900','凤庆县',2,0),('530922','530900','云县',2,0),('530923','530900','永德县',2,0),('530924','530900','镇康县',2,0),('530925','530900','双江拉祜族佤族布朗族傣族自治县',2,0),('530926','530900','耿马傣族佤族自治县',2,0),('530927','530900','沧源佤族自治县',2,0),('532300','530000','楚雄彝族自治州',1,0),('532301','532300','楚雄市',2,0),('532322','532300','双柏县',2,0),('532323','532300','牟定县',2,0),('532324','532300','南华县',2,0),('532325','532300','姚安县',2,0),('532326','532300','大姚县',2,0),('532327','532300','永仁县',2,0),('532328','532300','元谋县',2,0),('532329','532300','武定县',2,0),('532331','532300','禄丰县',2,0),('532500','530000','红河哈尼族彝族自治州',1,0),('532501','532500','个旧市',2,0),('532502','532500','开远市',2,0),('532503','532500','蒙自市',2,0),('532504','532500','弥勒市',2,0),('532523','532500','屏边苗族自治县',2,0),('532524','532500','建水县',2,0),('532525','532500','石屏县',2,0),('532527','532500','泸西县',2,0),('532528','532500','元阳县',2,0),('532529','532500','红河县',2,0),('532530','532500','金平苗族瑶族傣族自治县',2,0),('532531','532500','绿春县',2,0),('532532','532500','河口瑶族自治县',2,0),('532600','530000','文山壮族苗族自治州',1,0),('532601','532600','文山市',2,0),('532622','532600','砚山县',2,0),('532623','532600','西畴县',2,0),('532624','532600','麻栗坡县',2,0),('532625','532600','马关县',2,0),('532626','532600','丘北县',2,0),('532627','532600','广南县',2,0),('532628','532600','富宁县',2,0),('532800','530000','西双版纳傣族自治州',1,0),('532801','532800','景洪市',2,0),('532822','532800','勐海县',2,0),('532823','532800','勐腊县',2,0),('532900','530000','大理白族自治州',1,0),('532901','532900','大理市',2,0),('532922','532900','漾濞彝族自治县',2,0),('532923','532900','祥云县',2,0),('532924','532900','宾川县',2,0),('532925','532900','弥渡县',2,0),('532926','532900','南涧彝族自治县',2,0),('532927','532900','巍山彝族回族自治县',2,0),('532928','532900','永平县',2,0),('532929','532900','云龙县',2,0),('532930','532900','洱源县',2,0),('532931','532900','剑川县',2,0),('532932','532900','鹤庆县',2,0),('533100','530000','德宏傣族景颇族自治州',1,0),('533102','533100','瑞丽市',2,0),('533103','533100','芒市',2,0),('533122','533100','梁河县',2,0),('533123','533100','盈江县',2,0),('533124','533100','陇川县',2,0),('533300','530000','怒江傈僳族自治州',1,0),('533321','533300','泸水县',2,0),('533323','533300','福贡县',2,0),('533324','533300','贡山独龙族怒族自治县',2,0),('533325','533300','兰坪白族普米族自治县',2,0),('533400','530000','迪庆藏族自治州',1,0),('533421','533400','香格里拉县',2,0),('533422','533400','德钦县',2,0),('533423','533400','维西傈僳族自治县',2,0),('540000','0','西藏自治区',0,0),('540100','540000','拉萨市',1,0),('540102','540100','城关区',2,0),('540121','540100','林周县',2,0),('540122','540100','当雄县',2,0),('540123','540100','尼木县',2,0),('540124','540100','曲水县',2,0),('540125','540100','堆龙德庆县',2,0),('540126','540100','达孜县',2,0),('540127','540100','墨竹工卡县',2,0),('540200','540000','日喀则市',1,0),('540202','540200','桑珠孜区',2,0),('540221','540200','南木林县',2,0),('540222','540200','江孜县',2,0),('540223','540200','定日县',2,0),('540224','540200','萨迦县',2,0),('540225','540200','拉孜县',2,0),('540226','540200','昂仁县',2,0),('540227','540200','谢通门县',2,0),('540228','540200','白朗县',2,0),('540229','540200','仁布县',2,0),('540230','540200','康马县',2,0),('540231','540200','定结县',2,0),('540232','540200','仲巴县',2,0),('540233','540200','亚东县',2,0),('540234','540200','吉隆县',2,0),('540235','540200','聂拉木县',2,0),('540236','540200','萨嘎县',2,0),('540237','540200','岗巴县',2,0),('542100','540000','昌都地区',1,0),('542121','542100','昌都县',2,0),('542122','542100','江达县',2,0),('542123','542100','贡觉县',2,0),('542124','542100','类乌齐县',2,0),('542125','542100','丁青县',2,0),('542126','542100','察雅县',2,0),('542127','542100','八宿县',2,0),('542128','542100','左贡县',2,0),('542129','542100','芒康县',2,0),('542132','542100','洛隆县',2,0),('542133','542100','边坝县',2,0),('542200','540000','山南地区',1,0),('542221','542200','乃东县',2,0),('542222','542200','扎囊县',2,0),('542223','542200','贡嘎县',2,0),('542224','542200','桑日县',2,0),('542225','542200','琼结县',2,0),('542226','542200','曲松县',2,0),('542227','542200','措美县',2,0),('542228','542200','洛扎县',2,0),('542229','542200','加查县',2,0),('542231','542200','隆子县',2,0),('542232','542200','错那县',2,0),('542233','542200','浪卡子县',2,0),('542400','540000','那曲地区',1,0),('542421','542400','那曲县',2,0),('542422','542400','嘉黎县',2,0),('542423','542400','比如县',2,0),('542424','542400','聂荣县',2,0),('542425','542400','安多县',2,0),('542426','542400','申扎县',2,0),('542427','542400','索县',2,0),('542428','542400','班戈县',2,0),('542429','542400','巴青县',2,0),('542430','542400','尼玛县',2,0),('542431','542400','双湖县',2,0),('542500','540000','阿里地区',1,0),('542521','542500','普兰县',2,0),('542522','542500','札达县',2,0),('542523','542500','噶尔县',2,0),('542524','542500','日土县',2,0),('542525','542500','革吉县',2,0),('542526','542500','改则县',2,0),('542527','542500','措勤县',2,0),('542600','540000','林芝地区',1,0),('542621','542600','林芝县',2,0),('542622','542600','工布江达县',2,0),('542623','542600','米林县',2,0),('542624','542600','墨脱县',2,0),('542625','542600','波密县',2,0),('542626','542600','察隅县',2,0),('542627','542600','朗县',2,0),('610000','0','陕西省',0,0),('610100','610000','西安市',1,0),('610102','610100','新城区',2,0),('610103','610100','碑林区',2,0),('610104','610100','莲湖区',2,0),('610111','610100','灞桥区',2,0),('610112','610100','未央区',2,0),('610113','610100','雁塔区',2,0),('610114','610100','阎良区',2,0),('610115','610100','临潼区',2,0),('610116','610100','长安区',2,0),('610122','610100','蓝田县',2,0),('610124','610100','周至县',2,0),('610125','610100','户县',2,0),('610126','610100','高陵县',2,0),('610200','610000','铜川市',1,0),('610202','610200','王益区',2,0),('610203','610200','印台区',2,0),('610204','610200','耀州区',2,0),('610222','610200','宜君县',2,0),('610300','610000','宝鸡市',1,0),('610302','610300','渭滨区',2,0),('610303','610300','金台区',2,0),('610304','610300','陈仓区',2,0),('610322','610300','凤翔县',2,0),('610323','610300','岐山县',2,0),('610324','610300','扶风县',2,0),('610326','610300','眉县',2,0),('610327','610300','陇县',2,0),('610328','610300','千阳县',2,0),('610329','610300','麟游县',2,0),('610330','610300','凤县',2,0),('610331','610300','太白县',2,0),('610400','610000','咸阳市',1,0),('610402','610400','秦都区',2,0),('610403','610400','杨陵区',2,0),('610404','610400','渭城区',2,0),('610422','610400','三原县',2,0),('610423','610400','泾阳县',2,0),('610424','610400','乾县',2,0),('610425','610400','礼泉县',2,0),('610426','610400','永寿县',2,0),('610427','610400','彬县',2,0),('610428','610400','长武县',2,0),('610429','610400','旬邑县',2,0),('610430','610400','淳化县',2,0),('610431','610400','武功县',2,0),('610481','610400','兴平市',2,0),('610500','610000','渭南市',1,0),('610502','610500','临渭区',2,0),('610521','610500','华县',2,0),('610522','610500','潼关县',2,0),('610523','610500','大荔县',2,0),('610524','610500','合阳县',2,0),('610525','610500','澄城县',2,0),('610526','610500','蒲城县',2,0),('610527','610500','白水县',2,0),('610528','610500','富平县',2,0),('610581','610500','韩城市',2,0),('610582','610500','华阴市',2,0),('610600','610000','延安市',1,0),('610602','610600','宝塔区',2,0),('610621','610600','延长县',2,0),('610622','610600','延川县',2,0),('610623','610600','子长县',2,0),('610624','610600','安塞县',2,0),('610625','610600','志丹县',2,0),('610626','610600','吴起县',2,0),('610627','610600','甘泉县',2,0),('610628','610600','富县',2,0),('610629','610600','洛川县',2,0),('610630','610600','宜川县',2,0),('610631','610600','黄龙县',2,0),('610632','610600','黄陵县',2,0),('610700','610000','汉中市',1,0),('610702','610700','汉台区',2,0),('610721','610700','南郑县',2,0),('610722','610700','城固县',2,0),('610723','610700','洋县',2,0),('610724','610700','西乡县',2,0),('610725','610700','勉县',2,0),('610726','610700','宁强县',2,0),('610727','610700','略阳县',2,0),('610728','610700','镇巴县',2,0),('610729','610700','留坝县',2,0),('610730','610700','佛坪县',2,0),('610800','610000','榆林市',1,0),('610802','610800','榆阳区',2,0),('610821','610800','神木县',2,0),('610822','610800','府谷县',2,0),('610823','610800','横山县',2,0),('610824','610800','靖边县',2,0),('610825','610800','定边县',2,0),('610826','610800','绥德县',2,0),('610827','610800','米脂县',2,0),('610828','610800','佳县',2,0),('610829','610800','吴堡县',2,0),('610830','610800','清涧县',2,0),('610831','610800','子洲县',2,0),('610900','610000','安康市',1,0),('610902','610900','汉滨区',2,0),('610921','610900','汉阴县',2,0),('610922','610900','石泉县',2,0),('610923','610900','宁陕县',2,0),('610924','610900','紫阳县',2,0),('610925','610900','岚皋县',2,0),('610926','610900','平利县',2,0),('610927','610900','镇坪县',2,0),('610928','610900','旬阳县',2,0),('610929','610900','白河县',2,0),('611000','610000','商洛市',1,0),('611002','611000','商州区',2,0),('611021','611000','洛南县',2,0),('611022','611000','丹凤县',2,0),('611023','611000','商南县',2,0),('611024','611000','山阳县',2,0),('611025','611000','镇安县',2,0),('611026','611000','柞水县',2,0),('620000','0','甘肃省',0,0),('620100','620000','兰州市',1,0),('620102','620100','城关区',2,0),('620103','620100','七里河区',2,0),('620104','620100','西固区',2,0),('620105','620100','安宁区',2,0),('620111','620100','红古区',2,0),('620121','620100','永登县',2,0),('620122','620100','皋兰县',2,0),('620123','620100','榆中县',2,0),('620200','620000','嘉峪关市',1,0),('620300','620000','金昌市',1,0),('620302','620300','金川区',2,0),('620321','620300','永昌县',2,0),('620400','620000','白银市',1,0),('620402','620400','白银区',2,0),('620403','620400','平川区',2,0),('620421','620400','靖远县',2,0),('620422','620400','会宁县',2,0),('620423','620400','景泰县',2,0),('620500','620000','天水市',1,0),('620502','620500','秦州区',2,0),('620503','620500','麦积区',2,0),('620521','620500','清水县',2,0),('620522','620500','秦安县',2,0),('620523','620500','甘谷县',2,0),('620524','620500','武山县',2,0),('620525','620500','张家川回族自治县',2,0),('620600','620000','武威市',1,0),('620602','620600','凉州区',2,0),('620621','620600','民勤县',2,0),('620622','620600','古浪县',2,0),('620623','620600','天祝藏族自治县',2,0),('620700','620000','张掖市',1,0),('620702','620700','甘州区',2,0),('620721','620700','肃南裕固族自治县',2,0),('620722','620700','民乐县',2,0),('620723','620700','临泽县',2,0),('620724','620700','高台县',2,0),('620725','620700','山丹县',2,0),('620800','620000','平凉市',1,0),('620802','620800','崆峒区',2,0),('620821','620800','泾川县',2,0),('620822','620800','灵台县',2,0),('620823','620800','崇信县',2,0),('620824','620800','华亭县',2,0),('620825','620800','庄浪县',2,0),('620826','620800','静宁县',2,0),('620900','620000','酒泉市',1,0),('620902','620900','肃州区',2,0),('620921','620900','金塔县',2,0),('620922','620900','瓜州县',2,0),('620923','620900','肃北蒙古族自治县',2,0),('620924','620900','阿克塞哈萨克族自治县',2,0),('620981','620900','玉门市',2,0),('620982','620900','敦煌市',2,0),('621000','620000','庆阳市',1,0),('621002','621000','西峰区',2,0),('621021','621000','庆城县',2,0),('621022','621000','环县',2,0),('621023','621000','华池县',2,0),('621024','621000','合水县',2,0),('621025','621000','正宁县',2,0),('621026','621000','宁县',2,0),('621027','621000','镇原县',2,0),('621100','620000','定西市',1,0),('621102','621100','安定区',2,0),('621121','621100','通渭县',2,0),('621122','621100','陇西县',2,0),('621123','621100','渭源县',2,0),('621124','621100','临洮县',2,0),('621125','621100','漳县',2,0),('621126','621100','岷县',2,0),('621200','620000','陇南市',1,0),('621202','621200','武都区',2,0),('621221','621200','成县',2,0),('621222','621200','文县',2,0),('621223','621200','宕昌县',2,0),('621224','621200','康县',2,0),('621225','621200','西和县',2,0),('621226','621200','礼县',2,0),('621227','621200','徽县',2,0),('621228','621200','两当县',2,0),('622900','620000','临夏回族自治州',1,0),('622901','622900','临夏市',2,0),('622921','622900','临夏县',2,0),('622922','622900','康乐县',2,0),('622923','622900','永靖县',2,0),('622924','622900','广河县',2,0),('622925','622900','和政县',2,0),('622926','622900','东乡族自治县',2,0),('622927','622900','积石山保安族东乡族撒拉族自治县',2,0),('623000','620000','甘南藏族自治州',1,0),('623001','623000','合作市',2,0),('623021','623000','临潭县',2,0),('623022','623000','卓尼县',2,0),('623023','623000','舟曲县',2,0),('623024','623000','迭部县',2,0),('623025','623000','玛曲县',2,0),('623026','623000','碌曲县',2,0),('623027','623000','夏河县',2,0),('630000','0','青海省',0,0),('630100','630000','西宁市',1,0),('630102','630100','城东区',2,0),('630103','630100','城中区',2,0),('630104','630100','城西区',2,0),('630105','630100','城北区',2,0),('630121','630100','大通回族土族自治县',2,0),('630122','630100','湟中县',2,0),('630123','630100','湟源县',2,0),('630200','630000','海东市',1,0),('630202','630200','乐都区',2,0),('630221','630200','平安县',2,0),('630222','630200','民和回族土族自治县',2,0),('630223','630200','互助土族自治县',2,0),('630224','630200','化隆回族自治县',2,0),('630225','630200','循化撒拉族自治县',2,0),('632200','630000','海北藏族自治州',1,0),('632221','632200','门源回族自治县',2,0),('632222','632200','祁连县',2,0),('632223','632200','海晏县',2,0),('632224','632200','刚察县',2,0),('632300','630000','黄南藏族自治州',1,0),('632321','632300','同仁县',2,0),('632322','632300','尖扎县',2,0),('632323','632300','泽库县',2,0),('632324','632300','河南蒙古族自治县',2,0),('632500','630000','海南藏族自治州',1,0),('632521','632500','共和县',2,0),('632522','632500','同德县',2,0),('632523','632500','贵德县',2,0),('632524','632500','兴海县',2,0),('632525','632500','贵南县',2,0),('632600','630000','果洛藏族自治州',1,0),('632621','632600','玛沁县',2,0),('632622','632600','班玛县',2,0),('632623','632600','甘德县',2,0),('632624','632600','达日县',2,0),('632625','632600','久治县',2,0),('632626','632600','玛多县',2,0),('632700','630000','玉树藏族自治州',1,0),('632701','632700','玉树市',2,0),('632722','632700','杂多县',2,0),('632723','632700','称多县',2,0),('632724','632700','治多县',2,0),('632725','632700','囊谦县',2,0),('632726','632700','曲麻莱县',2,0),('632800','630000','海西蒙古族藏族自治州',1,0),('632801','632800','格尔木市',2,0),('632802','632800','德令哈市',2,0),('632821','632800','乌兰县',2,0),('632822','632800','都兰县',2,0),('632823','632800','天峻县',2,0),('640000','0','宁夏回族自治区',0,0),('640100','640000','银川市',1,0),('640104','640100','兴庆区',2,0),('640105','640100','西夏区',2,0),('640106','640100','金凤区',2,0),('640121','640100','永宁县',2,0),('640122','640100','贺兰县',2,0),('640181','640100','灵武市',2,0),('640200','640000','石嘴山市',1,0),('640202','640200','大武口区',2,0),('640205','640200','惠农区',2,0),('640221','640200','平罗县',2,0),('640300','640000','吴忠市',1,0),('640302','640300','利通区',2,0),('640303','640300','红寺堡区',2,0),('640323','640300','盐池县',2,0),('640324','640300','同心县',2,0),('640381','640300','青铜峡市',2,0),('640400','640000','固原市',1,0),('640402','640400','原州区',2,0),('640422','640400','西吉县',2,0),('640423','640400','隆德县',2,0),('640424','640400','泾源县',2,0),('640425','640400','彭阳县',2,0),('640500','640000','中卫市',1,0),('640502','640500','沙坡头区',2,0),('640521','640500','中宁县',2,0),('640522','640500','海原县',2,0),('650000','0','新疆维吾尔自治区',0,0),('650100','650000','乌鲁木齐市',1,0),('650102','650100','天山区',2,0),('650103','650100','沙依巴克区',2,0),('650104','650100','新市区',2,0),('650105','650100','水磨沟区',2,0),('650106','650100','头屯河区',2,0),('650107','650100','达坂城区',2,0),('650109','650100','米东区',2,0),('650121','650100','乌鲁木齐县',2,0),('650200','650000','克拉玛依市',1,0),('650202','650200','独山子区',2,0),('650203','650200','克拉玛依区',2,0),('650204','650200','白碱滩区',2,0),('650205','650200','乌尔禾区',2,0),('652100','650000','吐鲁番地区',1,0),('652101','652100','吐鲁番市',2,0),('652122','652100','鄯善县',2,0),('652123','652100','托克逊县',2,0),('652200','650000','哈密地区',1,0),('652201','652200','哈密市',2,0),('652222','652200','巴里坤哈萨克自治县',2,0),('652223','652200','伊吾县',2,0),('652300','650000','昌吉回族自治州',1,0),('652301','652300','昌吉市',2,0),('652302','652300','阜康市',2,0),('652323','652300','呼图壁县',2,0),('652324','652300','玛纳斯县',2,0),('652325','652300','奇台县',2,0),('652327','652300','吉木萨尔县',2,0),('652328','652300','木垒哈萨克自治县',2,0),('652700','650000','博尔塔拉蒙古自治州',1,0),('652701','652700','博乐市',2,0),('652702','652700','阿拉山口市',2,0),('652722','652700','精河县',2,0),('652723','652700','温泉县',2,0),('652800','650000','巴音郭楞蒙古自治州',1,0),('652801','652800','库尔勒市',2,0),('652822','652800','轮台县',2,0),('652823','652800','尉犁县',2,0),('652824','652800','若羌县',2,0),('652825','652800','且末县',2,0),('652826','652800','焉耆回族自治县',2,0),('652827','652800','和静县',2,0),('652828','652800','和硕县',2,0),('652829','652800','博湖县',2,0),('652900','650000','阿克苏地区',1,0),('652901','652900','阿克苏市',2,0),('652922','652900','温宿县',2,0),('652923','652900','库车县',2,0),('652924','652900','沙雅县',2,0),('652925','652900','新和县',2,0),('652926','652900','拜城县',2,0),('652927','652900','乌什县',2,0),('652928','652900','阿瓦提县',2,0),('652929','652900','柯坪县',2,0),('653000','650000','克孜勒苏柯尔克孜自治州',1,0),('653001','653000','阿图什市',2,0),('653022','653000','阿克陶县',2,0),('653023','653000','阿合奇县',2,0),('653024','653000','乌恰县',2,0),('653100','650000','喀什地区',1,0),('653101','653100','喀什市',2,0),('653121','653100','疏附县',2,0),('653122','653100','疏勒县',2,0),('653123','653100','英吉沙县',2,0),('653124','653100','泽普县',2,0),('653125','653100','莎车县',2,0),('653126','653100','叶城县',2,0),('653127','653100','麦盖提县',2,0),('653128','653100','岳普湖县',2,0),('653129','653100','伽师县',2,0),('653130','653100','巴楚县',2,0),('653131','653100','塔什库尔干塔吉克自治县',2,0),('653200','650000','和田地区',1,0),('653201','653200','和田市',2,0),('653221','653200','和田县',2,0),('653222','653200','墨玉县',2,0),('653223','653200','皮山县',2,0),('653224','653200','洛浦县',2,0),('653225','653200','策勒县',2,0),('653226','653200','于田县',2,0),('653227','653200','民丰县',2,0),('654000','650000','伊犁哈萨克自治州',1,0),('654002','654000','伊宁市',2,0),('654003','654000','奎屯市',2,0),('654021','654000','伊宁县',2,0),('654022','654000','察布查尔锡伯自治县',2,0),('654023','654000','霍城县',2,0),('654024','654000','巩留县',2,0),('654025','654000','新源县',2,0),('654026','654000','昭苏县',2,0),('654027','654000','特克斯县',2,0),('654028','654000','尼勒克县',2,0),('654200','650000','塔城地区',1,0),('654201','654200','塔城市',2,0),('654202','654200','乌苏市',2,0),('654221','654200','额敏县',2,0),('654223','654200','沙湾县',2,0),('654224','654200','托里县',2,0),('654225','654200','裕民县',2,0),('654226','654200','和布克赛尔蒙古自治县',2,0),('654300','650000','阿勒泰地区',1,0),('654301','654300','阿勒泰市',2,0),('654321','654300','布尔津县',2,0),('654322','654300','富蕴县',2,0),('654323','654300','福海县',2,0),('654324','654300','哈巴河县',2,0),('654325','654300','青河县',2,0),('654326','654300','吉木乃县',2,0),('659000','650000','自治区直辖县级行政区划',1,0),('659001','659000','石河子市',2,0),('659002','659000','阿拉尔市',2,0),('659003','659000','图木舒克市',2,0),('659004','659000','五家渠市',2,0),('710000','0','台湾省',0,0),('810000','0','香港特别行政区',0,0),('820000','0','澳门特别行政区',0,0);

/*Table structure for table `s_dict` */

DROP TABLE IF EXISTS `s_dict`;

CREATE TABLE `s_dict` (
  `did` int(5) NOT NULL COMMENT '字典ID',
  `name` varchar(20) NOT NULL COMMENT '字典名称',
  `memo` varchar(40) DEFAULT NULL COMMENT '字典备注',
  PRIMARY KEY (`did`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `s_dict` */

/*Table structure for table `s_dicts` */

DROP TABLE IF EXISTS `s_dicts`;

CREATE TABLE `s_dicts` (
  `did` int(5) NOT NULL COMMENT '字典ID',
  `name` varchar(20) NOT NULL COMMENT '展示名称',
  `status` tinyint(1) NOT NULL COMMENT '状态，1启用',
  `idx` int(2) NOT NULL DEFAULT '0' COMMENT '排序',
  PRIMARY KEY (`did`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `s_dicts` */

/*Table structure for table `s_status` */

DROP TABLE IF EXISTS `s_status`;

CREATE TABLE `s_status` (
  `id` int(4) NOT NULL COMMENT '状态id',
  `name` varchar(20) NOT NULL COMMENT '状态名称',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `s_status` */

insert  into `s_status`(`id`,`name`) values (0,'审核通过'),(1,'新增'),(2,'修改'),(3,'驳回'),(4,'关闭'),(5,'过期'),(6,'商品关闭'),(7,'商品类型关闭'),(8,'商品禁用'),(9,'商品类型禁用'),(10,'开奖中'),(11,'已开奖'),(12,'用户订单未付款'),(13,'用户订单过期未付款');

/*Table structure for table `u_account` */

DROP TABLE IF EXISTS `u_account`;

CREATE TABLE `u_account` (
  `uid` int(11) NOT NULL COMMENT '用户id',
  `golds` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '金币',
  `moneys` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '余额',
  `golds_d` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '冻结金币',
  `moneys_d` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '冻结余额',
  `golds_n` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '不可提现金币',
  `monty_n` decimal(18,2) NOT NULL DEFAULT '0.00' COMMENT '不可体现余额',
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `u_account` */

insert  into `u_account`(`uid`,`golds`,`moneys`,`golds_d`,`moneys_d`,`golds_n`,`monty_n`) values (3,'0.00','0.00','0.00','0.00','0.00','0.00'),(4,'0.00','0.00','0.00','0.00','0.00','0.00');

/*Table structure for table `u_address` */

DROP TABLE IF EXISTS `u_address`;

CREATE TABLE `u_address` (
  `id` int(18) NOT NULL AUTO_INCREMENT COMMENT '地址ID',
  `name` varchar(20) NOT NULL COMMENT '收货人姓名',
  `mobile` varchar(11) NOT NULL COMMENT '收货人手机',
  `area_p` varchar(6) NOT NULL COMMENT '省',
  `area_c` varchar(6) DEFAULT NULL COMMENT '市',
  `area_d` varchar(6) DEFAULT NULL COMMENT '县',
  `address` varchar(50) NOT NULL COMMENT '具体地址',
  `uid` int(11) NOT NULL COMMENT '用户ID',
  `status` tinyint(2) NOT NULL DEFAULT '0' COMMENT '状态',
  `choose` int(1) NOT NULL DEFAULT '0' COMMENT '默认，1默认，0正常',
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `uid` (`uid`,`status`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8;

/*Data for the table `u_address` */

insert  into `u_address`(`id`,`name`,`mobile`,`area_p`,`area_c`,`area_d`,`address`,`uid`,`status`,`choose`,`createtime`) values (1,'钟渚华','15914031197','440000','440300','440305','南山科技园某大厦A期1808',1,0,0,'2015-12-09 17:47:20'),(3,'钟渚华','13700088888','440000','440300','440304','福田上沙东村某巷002号999',1,0,1,'2015-12-09 17:47:20'),(10,'小伙子','13711012934','440000','441300',NULL,'我是一个阳光的小伙子',1,0,0,'2015-12-09 17:47:20'),(11,'小钟','15914031197','440000','440500',NULL,'潮南两英古厝乡',1,0,0,'2015-12-09 17:47:20'),(21,'钟渚华','15914031198','130000','130500',NULL,'我也就是测试一下啊',1,0,0,'0000-00-00 00:00:00'),(22,'奥特曼','15900000000','120000','120112',NULL,'我在宇宙的中心1001号',1,0,0,'0000-00-00 00:00:00');

/*Table structure for table `u_user` */

DROP TABLE IF EXISTS `u_user`;

CREATE TABLE `u_user` (
  `uid` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `name` varchar(20) NOT NULL DEFAULT '幕拍用户' COMMENT '用户姓名',
  `sex` varchar(2) NOT NULL DEFAULT '男' COMMENT '用户性别',
  `age` int(3) NOT NULL DEFAULT '0' COMMENT '年龄',
  `birthday` date NOT NULL DEFAULT '1980-01-01' COMMENT '出身日期',
  `email` varchar(50) DEFAULT NULL COMMENT '邮箱',
  `mobile` varchar(11) DEFAULT NULL COMMENT '手机号',
  `upass` varchar(100) DEFAULT NULL COMMENT '登录密码',
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '建号日期',
  `status` int(2) NOT NULL DEFAULT '0' COMMENT '状态',
  `photo` varchar(50) DEFAULT NULL COMMENT '用户头像',
  `openid` varchar(50) DEFAULT NULL COMMENT '微信openid',
  PRIMARY KEY (`uid`),
  UNIQUE KEY `openid` (`openid`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `u_user` */

insert  into `u_user`(`uid`,`name`,`sex`,`age`,`birthday`,`email`,`mobile`,`upass`,`createtime`,`status`,`photo`,`openid`) values (3,'u_2939693777','男',0,'1980-01-01',NULL,NULL,NULL,'2016-05-06 18:15:55',0,NULL,'oShzOvkfFLvVNSW6G5rrYNO9NCaw'),(4,'u_6220772945','男',0,'1980-01-01',NULL,NULL,NULL,'2016-05-06 18:23:49',0,NULL,'oShzOvvVgOWkwVAMj2JM9ljkz9C0');

/*!50106 set global event_scheduler = 1*/;

/* Event structure for event `myevent_calwinner` */

/*!50106 DROP EVENT IF EXISTS `myevent_calwinner`*/;

DELIMITER $$

/*!50106 CREATE DEFINER=`root`@`localhost` EVENT `myevent_calwinner` ON SCHEDULE EVERY 50 SECOND STARTS '2015-12-28 15:13:44' ON COMPLETION NOT PRESERVE ENABLE DO BEGIN 
 
	    call pro_calWinner();
	END */$$
DELIMITER ;

/* Event structure for event `myevent_unfrozen_order` */

/*!50106 DROP EVENT IF EXISTS `myevent_unfrozen_order`*/;

DELIMITER $$

/*!50106 CREATE DEFINER=`root`@`localhost` EVENT `myevent_unfrozen_order` ON SCHEDULE EVERY 180 SECOND STARTS '2015-12-28 15:13:44' ON COMPLETION NOT PRESERVE ENABLE DO BEGIN 
  -- **************** 每3分钟解冻冻结的金额 ********************
  -- 遍历属性
  DECLARE p_uid INT;
  DECLARE p_orderno VARCHAR(30);
  -- 是否出错
  DECLARE _err INT;
  -- 定义游标遍历数据结束标志
  DECLARE done INT DEFAULT 0;
  DECLARE cur_tran CURSOR FOR SELECT orderno,uid FROM ou_order WHERE STATUS=12 AND createtime<DATE_SUB(NOW(),INTERVAL 3 MINUTE);
  declare continue handler for not found set done=1; 
  -- 如果出现 sqlexception 则执行 rollback
  declare exit handler for sqlexception begin rollback;end;
  
  -- 打开游标
  OPEN cur_tran;
  -- 开始循环
  read_loop:LOOP
    FETCH cur_tran INTO p_orderno,p_uid;
    -- 如果读不到数据，则结束
    IF done THEN
      LEAVE read_loop;
    END IF;
    
    -- 开始事务
    START TRANSACTION;
      SET _err=0;
      UPDATE ou_order a SET STATUS=13,closetime=NOW() WHERE orderno=p_orderno;
      -- 更新订单状态 
      UPDATE o_order a INNER JOIN ou_orderinfo b ON a.orderno=b.orderno SET a.now_price=a.now_price-b.times,a.frozen_price=a.frozen_price-b.times;
      SELECT COUNT(1) INTO _err FROM o_order a WHERE a.now_price<0 OR a.frozen_price<0;
      IF _err=0 THEN
	COMMIT;
      ELSE 
        ROLLBACK;
      END IF; 
  END LOOP;
  CLOSE cur_tran;
END */$$
DELIMITER ;

/* Function  structure for function  `fun_getorderno` */

/*!50003 DROP FUNCTION IF EXISTS `fun_getorderno` */;
DELIMITER $$

/*!50003 CREATE DEFINER=`root`@`localhost` FUNCTION `fun_getorderno`() RETURNS varchar(40) CHARSET utf8
BEGIN
RETURN CONCAT(DATE_FORMAT(NOW(),'%Y%m%d%H%i%s'),LPAD(ROUND(ROUND(RAND(),8)*100000000),8,'0'));
    END */$$
DELIMITER ;

/* Procedure structure for procedure `pro_calWinner` */

/*!50003 DROP PROCEDURE IF EXISTS  `pro_calWinner` */;

DELIMITER $$

/*!50003 CREATE DEFINER=`root`@`localhost` PROCEDURE `pro_calWinner`()
BEGIN
  DECLARE c_orderno VARCHAR(40);
  
  -- 定义游标遍历数据结束标志
  DECLARE done INT DEFAULT 0;
  DECLARE cur_tran CURSOR FOR SELECT a.orderno FROM o_order a WHERE a.status=10;
  DECLARE CONTINUE HANDLER FOR NOT FOUND SET done=1; 
   
  -- 打开游标
  OPEN cur_tran;
  -- 开始循环
  read_loop:LOOP
    FETCH cur_tran INTO c_orderno;
    -- 如果读不到数据，则结束
    IF done THEN
      LEAVE read_loop;
    END IF; 
    
    CALL pro_winner(c_orderno, @result);
  END LOOP;
  CLOSE cur_tran;
    END */$$
DELIMITER ;

/* Procedure structure for procedure `pro_neworder` */

/*!50003 DROP PROCEDURE IF EXISTS  `pro_neworder` */;

DELIMITER $$

/*!50003 CREATE DEFINER=`root`@`localhost` PROCEDURE `pro_neworder`(in p_sid int,OUT result VARCHAR(100))
label_pro:BEGIN
  -- 计算结束之后或者新建策略的时候，新增一张策略订单
  -- p_sid 策略id
  
  DECLARE v_orderno VARCHAR(22);
  -- 受影响行数
  DECLARE v_count INT DEFAULT 0;
  -- 下一期期数
  DECLARE v_ordernum INT DEFAULT 0;
  
  SELECT fun_getorderno() INTO v_orderno;
  -- 默认
  SET result='';
  
  -- 查询策略是否存在
  SELECT id INTO p_sid FROM p_strategy a WHERE a.id=p_sid AND a.status=0 AND NOW() BETWEEN a.begindate AND a.enddate;
  
  IF p_sid IS NULL OR p_sid<0 THEN
    SET result='策略已经失效';
    LEAVE label_pro;
  END IF;
  
  -- 查询下一期期数
  SELECT MAX(ordernum) INTO v_ordernum FROM o_order WHERE sid=p_sid;
  
  IF v_ordernum IS NULL OR v_ordernum=0 THEN
    SET v_ordernum=1;
  ELSE
    SET v_ordernum=v_ordernum+1;
  END IF;
  
  INSERT INTO o_order(orderno,pid,tid,sid,ordernum,STATUS,max_count,min_count,begin_price,prod_price,personNums,max_process,now_price)
  SELECT v_orderno,pid,tid,id,v_ordernum,0,max_count,min_count,begin_price,prod_price,personNums,max_process,0 FROM p_strategy WHERE id=p_sid;
  
  -- 查询订单创建是否成功
  SELECT COUNT(1) INTO v_count FROM o_order WHERE orderno=v_orderno;
  IF v_count IS NULL OR v_count!=1 THEN
    SET result='创建新订单失败';
    LEAVE label_pro;
  END IF;
  
  SET result='';
  
END */$$
DELIMITER ;

/* Procedure structure for procedure `pro_payorder` */

/*!50003 DROP PROCEDURE IF EXISTS  `pro_payorder` */;

DELIMITER $$

/*!50003 CREATE DEFINER=`root`@`localhost` PROCEDURE `pro_payorder`(IN p_utime VARCHAR(24),IN p_paymoney DECIMAL,IN p_orderno VARCHAR(40),OUT result VARCHAR(100))
label_pro:BEGIN
  -- 支付成功之后
  -- 订单冻结金额和支付成功的金额是否一致，如果一致，next
  -- 转移 ou_order 和 ou_orderinfo 到 o_order 和 o_ordercode 和 o_orderuser 中，成功 next
  -- 解冻冻结金额，解冻成功 next
  -- 解冻成功之后，是否达到 100% 如果达到 100% ，更新状态，成功 next
  -- 新成订单，commit
  -- result='' 成功
  DECLARE c_orderno VARCHAR(40);
  DECLARE c_times INT;
  DECLARE c_maxcode INT;
  
  
  -- 循环下标
  DECLARE v_index INT;  
  -- 订单所属用户id
  DECLARE v_uid INT DEFAULT 0;
  -- 受影响行数
  DECLARE v_count INT DEFAULT 0;
  -- 订单状态
  DECLARE v_status INT DEFAULT -1;
  -- 订单总金额
  DECLARE v_money DECIMAL DEFAULT 0;
  -- 策略号
  DECLARE v_sid INT DEFAULT 0;
  -- 是否有已经可以计算的订单
  DECLARE v_calWinner INT DEFAULT 0;
  
  -- 定义游标遍历数据结束标志
  DECLARE done INT DEFAULT 0;
  DECLARE cur_tran CURSOR FOR SELECT orderno,times FROM ou_orderinfo WHERE ou_orderno=p_orderno;
  DECLARE CONTINUE HANDLER FOR NOT FOUND SET done=1; 
  
  -- 如果出现 sqlexception 则执行 rollback
  DECLARE EXIT HANDLER FOR SQLEXCEPTION BEGIN ROLLBACK; END;
  
  -- 默认值
  SET result='系统异常';
  
  -- 判断订单号
  IF p_orderno IS NULL OR p_orderno='' THEN
    SET result='支付订单号异常，请刷新重试';
    LEAVE label_pro;
  END IF;
  -- 判断时间
  IF p_utime IS NULL OR p_utime='' THEN
    SET result='支付时间异常';
    LEAVE label_pro;
  END IF;
  
  -- 查询订单
  SELECT COUNT(1),MAX(a.status),SUM(b.times),MAX(a.uid)  INTO v_count,v_status,v_money,v_uid  FROM ou_order a INNER JOIN ou_orderinfo b ON a.orderno=b.ou_orderno WHERE a.orderno=p_orderno;
  
  -- 判断订单产品数量  
  IF v_count IS NULL OR v_count<=0 THEN
    SET result='系统查询不到支付的订单，请刷新重新';
    LEAVE label_pro;
  END IF;
  -- 判断订单状态
  IF v_status IS NULL THEN
    SET result='订单状态异常'; 
    LEAVE label_pro;
  END IF;
  IF v_status=0 THEN 
    SET result='订单已经支付成功，请进行其他操作';
    LEAVE label_pro;
  END IF;
  IF v_status!=12 THEN
    SET result='订单状态异常';
    LEAVE label_pro;
  END IF;
  -- 判断金额有效性
  IF v_money IS NULL OR v_money<=0 OR v_money!=p_paymoney THEN
    SET result='订单金额有误';
    LEAVE label_pro;
  END IF;
  
  -- 开始事务
  START TRANSACTION;
  -- 改变订单
  UPDATE ou_order a SET a.utime=p_utime,a.status=0 WHERE a.orderno=p_orderno AND a.status=12;
  SELECT ROW_COUNT() INTO v_count;  
  
  IF v_count!=1 THEN
    ROLLBACK;
    SET result='订单已过期，请申请退单';
    LEAVE label_pro;
  END IF;
  
  -- 转移订单到 o_orderuser
  INSERT INTO o_orderuser(orderno,times,utime,ou_orderno,uid)
  SELECT b.orderno,b.times,a.utime,a.orderno,a.uid FROM ou_order a
  INNER JOIN ou_orderinfo b ON a.orderno=b.ou_orderno
  WHERE a.orderno=p_orderno;
  
  -- 是否有订单已经失效
  SELECT COUNT(1) INTO v_count FROM ou_orderinfo a INNER JOIN o_order b ON a.orderno=b.orderno AND b.status=0 WHERE a.ou_orderno=p_orderno;
  IF v_count IS NULL OR v_count=0 THEN
    ROLLBACK;
    SET result='幕拍订单状态无效，请申请退单';
    LEAVE label_pro;
  END IF;
  
  -- 循环幕拍号码
  -- 打开游标
  OPEN cur_tran;
  -- 开始循环
  read_loop:LOOP
    FETCH cur_tran INTO c_orderno,c_times;
    -- 如果读不到数据，则结束
    IF done THEN
      LEAVE read_loop;
    END IF;
    
    -- 查询最大编码
    SELECT MAX(ucode) INTO c_maxcode FROM o_ordercode WHERE orderno=c_orderno;
    IF c_maxcode IS NULL OR c_maxcode=0 THEN
      SET c_maxcode=100000;
    END IF;
    
    IF c_orderno IS NULL OR c_times IS NULL OR c_times<=0 THEN
      ROLLBACK;
      SET result='订单信息有误，请申请退单';
      LEAVE label_pro;
    END IF;
     
    -- 循环添加幕拍号
    SET v_index=c_times;
    WHILE v_index>0 DO
      INSERT INTO o_ordercode(orderno,uid,utime,ucode) VALUES (c_orderno,v_uid,p_utime,c_maxcode+v_index);
      SET v_index=v_index-1;
    END WHILE;
    
    -- 解冻金额
    UPDATE o_order a SET a.frozen_price=a.frozen_price-c_times WHERE a.orderno=c_orderno AND a.status=0 AND a.frozen_price-c_times>=0 AND a.frozen_price-c_times<a.now_price;
    SELECT ROW_COUNT() INTO v_count;
    
    IF v_count!=1 THEN
      ROLLBACK;
      SET result='解冻订单金额出错，请申请退单';
      LEAVE label_pro;
    END IF;
    
    -- 是否已经完成
    SELECT (CASE WHEN a.prod_price=a.now_price AND a.frozen_price=0 THEN 1 ELSE 0 END),a.sid INTO v_status,v_sid FROM o_order a WHERE a.orderno=c_orderno;
    IF v_status=1 THEN
      call pro_neworder(v_sid, @result);
      UPDATE o_order a SET a.endtime=NOW(),a.status=10 WHERE a.orderno=c_orderno;
      SELECT ROW_COUNT() INTO v_count;
      -- 更新订单状态
      IF v_count!=1 THEN
        ROLLBACK;
        SET result='更新订单状态出错';
        LEAVE label_pro;
      END IF;
      set v_calWinner=1;
    END IF;
  END LOOP;
  CLOSE cur_tran;
 
  -- 事务提交 
  SET result='';
  COMMIT;
  
  IF v_calWinner=1 THEN
    CALL pro_calWinner(@result);
  END IF;
END */$$
DELIMITER ;

/* Procedure structure for procedure `pro_winner` */

/*!50003 DROP PROCEDURE IF EXISTS  `pro_winner` */;

DELIMITER $$

/*!50003 CREATE DEFINER=`root`@`localhost` PROCEDURE `pro_winner`(in p_orderno varchar(40),OUT result VARCHAR(100))
label_pro:BEGIN
  -- 计算获胜用户
  -- p_orderno [o_order订单号]
  DECLARE c_count INT;
  
  -- 最后 v_count 个时间和
  DECLARE v_time INT;
  -- 时间个数
  DECLARE v_timecount INT;
  -- 订单状态
  DECLARE v_status INT;
  -- 受影响行数
  DECLARE v_count INT;
  -- 中奖号码
  DECLARE v_wincode INT;
  
  -- 如果出现 sqlexception 则执行 rollback
  DECLARE EXIT HANDLER FOR SQLEXCEPTION BEGIN ROLLBACK; END;
  
  -- 默认值
  SET result='系统异常';
  
  -- 查询订单是否已经支付
  SELECT a.status INTO v_status FROM o_order a WHERE a.orderno=p_orderno;
 
  -- 判断订单 
  IF v_status IS NULL OR v_status NOT IN (10,11) THEN
    SET result='系统找不到可以计算的订单';
    LEAVE label_pro;
  END IF;
  
  -- 如果是 status=11 则是已经计算的了
  IF v_status=11 THEN
    SET result='';
    LEAVE label_pro;
  END IF;
  
  -- 否则开始计算
  SELECT SUM(utime) INTO v_time FROM (
    SELECT a.utime FROM (
      SELECT CAST(REPLACE(REPLACE(SUBSTRING(utime,12),':',''),'.','') AS SIGNED) utime FROM o_orderuser 
      WHERE utime<=(SELECT utime FROM o_orderuser WHERE orderno=p_orderno ORDER BY utime DESC LIMIT 0,1)
    ) a
    GROUP BY a.utime
    ORDER BY utime DESC LIMIT 0,50
  ) a;
  
  SELECT CAST(prod_price AS SIGNED) INTO v_timecount FROM o_order a WHERE a.orderno=p_orderno;
  
  -- 判断数值是否正确
  IF v_time IS NULL OR v_timecount IS NULL OR v_time=0 OR v_timecount=0 THEN
    SET result='计算中奖用户数值异常';
    LEAVE label_pro;
  END IF;
  
  SELECT v_time%v_timecount+100001 INTO v_wincode;
  
  -- 开始事务
  START TRANSACTION;
  
  -- 更新中奖用户
  UPDATE o_order a SET a.endno=v_wincode,a.status=11 WHERE a.status=10 AND a.orderno=p_orderno;
  SELECT ROW_COUNT() INTO v_count;
  IF v_count!=1 THEN
    ROLLBACK;
    SET result='更新中奖用户失败';
    LEAVE label_pro;
  END IF;
  
  -- 迁移往期订单
  INSERT INTO oo_order SELECT * FROM o_order a WHERE a.orderno=p_orderno;
  INSERT INTO oo_ordercode SELECT * FROM o_ordercode a WHERE a.orderno=p_orderno;
  INSERT INTO oo_orderuser SELECT * FROM o_orderuser a WHERE a.orderno=p_orderno;
  
  COMMIT;
  
  SET result='';
END */$$
DELIMITER ;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
